<template>
   <section class="faq">
        <div class="container">
            <div class="faq-banner">
                <img src="/FAQ.png" alt="">
            </div>
            <div class="section-header">ВОПРОСЫ И ОТВЕТЫ</div>
            <div class="faq-items">
                <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Где и когда пройдет Стримфест 2021?
                </button>
                <div class="faq-item__inner">
                    <p>Стримфест 2021 пройдет в <a href="https://sk.ru/technopark/">Технопарке «Сколково» 17 и 18 апреля с 11:00 до 19:00.</a></p>

					<p>К нам можно легко доехать на метро направления <a href="https://www.mos.ru/city/projects/diametry/">МЦД-1</a> (станция «Сколково»), а также на <a href="https://streamfest.ru/contact">такси, общественным и личным транспортом.</a></p>
                </div>
                <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Я стример или подкастер, как мне стать участником фестиваля?
                </button>
                <div class="faq-item__inner">
                    <p>Проверьте, соответствуете ли вы критериям на странице <a href="https://streamfest.ru/apply">Стать участником</a>, и напишите организаторам в <a href="https://vk.com/mikhail_lisetskiy">VK</a> или на <a href="mailto:mike@streamfest.ru">mike@streamfest.ru</a>.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Я развиваюсь как стример, но канал пока небольшой.
					Можно мне билет на Стримфест?
                </button>
                <div class="faq-item__inner">
                    <p>Да! Если вы регулярно стримите видеоигры и у вас больше 3000 подписчиков на любой из стрим-платформ
(Twitch.tv, YouTube, TikTok, VK, OK, WASD, Goodgame, Instagram), мы дадим вам бесплатный билет на оба дня
фестиваля. </p>

<p>Стримерам неигровых направлений мы даем билеты за меньшие цифры — достаточно 1000 подписчиков.</p>

<p>Только проверим, что на канале нет накруток. Чтобы получить билет, напишите <a href="https://vk.com/mikhail_lisetskiy">организаторам в VK</a> или
на <a href="mailto:info@streamfest.ru">info@streamfest.ru</a>.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Что будет на Стримфесте?
                </button>
                <div class="faq-item__inner">
                    <p>Стримфест — это большая развлекательная зона, главная и музыкальная сцены, лекторий, и все на одной
					площадке.</p>

					<p>В развлекательной зоне множество стендов со своими программами. Участники фестиваля будут стримить
					на виду у всех, проводить конкурсы, устраивать шоу. Стримеры и подкастеры постараются вас удивить.
					Будет весело! Здесь же можно поучаствовать в активностях от партнеров фестиваля, протестировать
					новинки игровой индустрии и технологии от резидентов «Сколково».</p>

					<p>Музыкальная сцена работает нон-стоп: вас ждут самые популярные поющие стримеры, стримеры-музыканты
					и приглашенные группы.</p>

					<p>На главной сцене состоятся шоу-матчи с участием известных прогеймеров, стримеров и простых зрителей.
					Там же пройдут дефиле косплееров, игровые презентации, жаркие дебаты и церемонии открытия/закрытия.
					В залах лектория — своя программа: полезные мастер-классы для начинающих и продвинутых стримеров/
					подкастеров, встречи с руководителями стрим-платформ и не только. Мы подробнее расскажем о всех
					деталях программы ближе к Стримфесту. В марте на сайте появится подробное расписание лектория, а пока
					<a href="https://vk.com/streamfest">следите за новостями в группе VK.</a></p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Сколько стоят и чем отличаются билеты?
                </button>
                <div class="faq-item__inner">
                    <p>У нас два типа билетов: билет на один день за 1300 рублей и билет на оба дня за 2100 рублей. Билет на один
день позволяет посетить фестиваль или 17, или 18 апреля — на ваш выбор. </p>

<p>Количество билетов ограничено, и чем ближе к Стримфесту, тем дороже они будут.</p>

<p>Билеты можно купить <a href="https://streamfest.ru/tickets/">здесь</a> или через страницу <a href="https://streamfest.ru/stars/">любимого стримера или подкастера</a> — тогда он получит
часть стоимости билета. Неважно, через кого покупать билет, увидеться можно будет со всеми участниками
фестиваля. Однако некоторые участники будут на фестивале только один из дней — если хотите точно
повстречаться со всеми, приходите и 17, и 18 апреля.</p>

<p>Билет — это QR-код, который придет вам на email после оплаты. При входе на фестиваль билет считывается
и гасится, а вы получаете взамен браслет посетителя. С браслетом можно свободно входить и выходить с
фестиваля. Браслет нельзя передавать другому человеку. Если вы потеряете браслет, то восстановить его
будет нельзя.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Что дает покупка билета от определенного участника?
                </button>
                <div class="faq-item__inner">
                    <p>Это форма поддержки участника фестиваля. Часть стоимости билета пойдет стримеру/подкастеру, по ссылке
					которого вы купили билет. В целом билет от участника ничем не отличается от билета, купленного с кнопки
					<a href="https://streamfest.ru/tickets/">«Купить билет»</a>. </p>

					<p>Однако участник фестиваля может дополнительно вознаградить тех поклонников, которые купили билеты с
					его страницы (но как именно и делать ли это вообще, участник решает сам).
					</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Куда уходят личные данные, которые вводятся при покупке билета?
                </button>
                <div class="faq-item__inner">
                    <p>Организаторы Стримфеста действуют в соответствии с ФЗ №152 «О персональных данных». Если вы
					покупаете обычный билет на Стримфест на один или два дня, ваши персональные данные не передаются
					третьим лицам.</p>

					<p>Если вы покупаете билет от конкретного <a href="https://streamfest.ru/stars/">участника фестиваля</a>, то этот участник получает ваши имя
					(но не фамилию) и email — так участник сможет узнать, кто именно купил от него билет(ы), и
					взаимодействовать с вами, если захочет.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Какие возрастные ограничения?
                </button>
                <div class="faq-item__inner">
                    <p>Подростки 14-16 лет должны находиться на фестивале в постоянном сопровождении любого лица старше 18
					лет в соответствии с постановлением Правительства Москвы о массовых мероприятиях.</p>

					<p>Дети 8-13 лет на фестиваль не допускаются в соответствии с требованиями площадки.</p>

					<p>Дети до 8 лет должны находиться на фестивале в постоянном сопровождении своих родственников или
					опекунов в соответствии с ФЗ №124 (ст. 14).</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Я собираюсь на Стримфест с маленьким ребенком,
должен ли я платить за него?
                </button>
                <div class="faq-item__inner">
                    <p>Если вы родитель ребенка до 8 лет, то билет нужен только вам — ребенок сможет пройти на фестиваль
бесплатно. Только не забудьте взять свидетельство о рождении ребенка — его могут спросить на входе.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Что можно и нельзя проносить на фестиваль?
                </button>
                <div class="faq-item__inner">
                    <p>Нельзя проносить на Стримфест алкоголь, психотропные и наркотические вещества, бутафорское, холодное
и огнестрельное оружие, а также любые предметы, которыми можно нанести урон жизни и здоровью.
Вот <a href="https://docs.google.com/document/d/1UiAIfANWzYRYZuGIW1sj3tAQ20-_AUEnvvgt8-xdPKQ/edit?ts=5e528e2f">полные правила Технопарка «Сколково»</a>.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Где там поесть?
                </button>
                <div class="faq-item__inner">
                    <p>Прямо на фестивале работает столовая, где цены не кусаются. А также несколько кофеен, ресторан,
продуктовый магазин. Вот <a href="https://vk.com/wall-122887579_7265">подробности</a>.</p>
                </div>
                 <button class="faq-item">
                    <svg  width="13px" height="10px">
                        <path fill-rule="evenodd"  fill="rgb(186, 200, 207)"
                              d="M12.606,6.019 L10.716,0.359 C10.610,0.041 10.233,-0.063 9.994,0.161 L8.291,1.752 C7.661,1.270 5.329,1.270 4.699,1.752 L2.996,0.161 C2.757,-0.063 2.380,0.041 2.274,0.359 L0.384,6.019 C-0.003,7.177 0.492,8.468 1.543,8.990 C2.871,9.648 4.551,9.955 6.495,9.955 C8.439,9.955 10.118,9.648 11.447,8.990 C12.498,8.468 12.993,7.177 12.606,6.019 Z"/>
                    </svg>
                    Как я могу участвовать в формировании программы фестиваля?
                </button>
                <div class="faq-item__inner">
                    <p>Если вы хотите поучаствовать в работе лектория, выступить с интересным докладом или присоединиться к
дискуссионным панелям, напишите на <a href="mailto:mike@streamfest.ru">mike@streamfest.ru</a>.</p>
                </div>

                <div class="faq-item-last">
                    <h3 class="faq-item">У меня остались вопросы!</h3>
                    <p>Прекрасно, задайте их личным сообщением в нашей <a href="https://vk.com/streamfest">группе VK.</a></p>
                </div>


            </div>
            <Subscribe/>
        </div>
    </section>
</template>

<script>
import Subscribe from "@/components/Subscribe";

export default {
   components: {
    Subscribe,
  },
  scrollToTop: true,
  data() {
    return {
    };
  },
  mounted() {
    let acc = document.getElementsByClassName("faq-item");
    let i;
    for (i = 0; i < acc.length; i++) {
        acc[i].addEventListener("click", function() {
            this.classList.toggle("faq-item-active");
            let panel = this.nextElementSibling;
            if (panel.style.maxHeight) {
                panel.style.maxHeight = null;
            } else {
                panel.style.maxHeight = panel.scrollHeight + "px";
            }
        });
    }
  },
}
</script>
