<template>
  <section class="faq">
    <div class="pattern-bg "></div>
    <div class="faq-banner">
      <img src="/FAQ.png" alt="" />
    </div>
    <div class="container">

      <div class="section-header">ВОПРОСЫ И ОТВЕТЫ</div>
      <div class="faq-items">
        <button
          @click="toggleAccordion(1)"
          :class="{ 'faq-item-active': accordionIds.includes(1) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Где и когда пройдет Стримфест&nbsp;2021?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(1) }"
          class="faq-item__inner"
        >
          <p>
            Стримфест 2021 пройдет в
            <a
              href="https://sk.ru/"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >Технопарке «Сколково»</a
            >
            17 и 18&nbsp;июля с 11:00 до 19:00.
          </p>

          <p>
            К нам можно легко доехать на метро направления
            <a
              href="https://www.mos.ru/city/projects/diametry/"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >МЦД-1</a
            >
            (станция «Сколково»), а также на
            <a
              href="/contact"
              class="link"
              >такси, общественным и личным транспортом</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(2)"
          :class="{ 'faq-item-active': accordionIds.includes(2) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я стример или подкастер, как мне стать участником фестиваля?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(2) }"
          class="faq-item__inner"
        >
          <p>
            Проверьте, соответствуете ли вы критериям на странице
            <a
              href="/how-to"
              class="link"
              target="_blank"
            rel="noopener noreferrers"
              >Стать участником</a
            >, и напишите
            <a
              href="https://vk.com/mikhail_lisetskiy"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >организаторам в&nbsp;VK</a
            >
            или на
            <a href="mailto:mike@streamfest.ru" class="link"
              >mike@streamfest.ru</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(3)"
          :class="{ 'faq-item-active': accordionIds.includes(3) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я развиваюсь как стример, но канал пока небольшой. Можно мне
          билет на Стримфест?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(3) }"
          class="faq-item__inner"
        >
          <p>
            Да! Если вы регулярно стримите видеоигры и у вас больше 3000
            подписчиков на любой из стрим-платформ (Twitch.tv, YouTube, TikTok,
            VK, OK, WASD, Goodgame, Instagram), мы дадим вам бесплатный билет на
            оба дня фестиваля.
          </p>

          <p>
            Стримерам неигровых направлений мы даем билеты за меньшие цифры —
            достаточно 1000 подписчиков.
          </p>

          <p>
            Только проверим, что на канале нет накруток. Чтобы получить билет,
            <a
              href="https://vk.com/mikhail_lisetskiy"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >напишите организаторам в VK</a
            >
            или на&nbsp;<a href="mailto:info@streamfest.ru" class="link"
              >info@streamfest.ru</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(4)"
          :class="{ 'faq-item-active': accordionIds.includes(4) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что будет на Стримфесте?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(4) }"
          class="faq-item__inner"
        >
          <p>
            Стримфест — это большая развлекательная зона, главная и музыкальная
            сцены, лекторий, и все на одной площадке.
          </p>

          <p>
            В развлекательной зоне множество стендов со своими программами.
            Участники фестиваля будут стримить на виду у всех, проводить
            конкурсы, устраивать шоу. Стримеры и подкастеры постараются вас
            удивить. Будет весело! Здесь же можно поучаствовать в активностях от
            партнеров фестиваля, протестировать новинки игровой индустрии и
            технологии от резидентов «Сколково».
          </p>

          <p>
            Музыкальная сцена работает нон-стоп: вас ждут самые популярные
            поющие стримеры, стримеры-музыканты и приглашенные группы.
          </p>

          <p>
            На главной сцене состоятся шоу-матчи с участием известных
            прогеймеров, стримеров и простых зрителей. Там же пройдут дефиле
            косплееров, игровые презентации, жаркие дебаты и церемонии
            открытия/закрытия. </p>
            <p>В залах лектория — своя программа: полезные
            мастер-классы для начинающих и продвинутых стримеров/ подкастеров,
            встречи с руководителями стрим-платформ и не только. </p>
            <p>Мы подробнее
            расскажем о всех деталях программы ближе к Стримфесту. В мае на
            сайте появится подробное расписание лектория, а пока
            <a
              href="https://vk.com/streamfest"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >следите за новостями в группе VK</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(5)"
          :class="{ 'faq-item-active': accordionIds.includes(5) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Сколько стоят и чем отличаются билеты?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(5) }"
          class="faq-item__inner"
        >
          <p>
            У нас два типа билетов: билет на один день за 1300&nbsp;рублей и билет на
            оба дня за 2100&nbsp;рублей. Билет на один день позволяет посетить
            фестиваль или 17, или 18&nbsp;июля — на ваш выбор.
          </p>

          <p>
            Количество билетов ограничено, и чем ближе к Стримфесту, тем дороже
            они будут.
          </p>

          <p>
            Билеты можно <a class="link" href="/#tickets">купить здесь</a> или через страницу любимого
            <nuxt-link to="/stars" class="link"
              >стримера или подкастера</nuxt-link>
            — тогда он получит часть стоимости билета. Неважно, через кого
            покупать билет, увидеться можно будет со всеми участниками
            фестиваля. Однако некоторые участники будут на фестивале только один
            из дней — если хотите точно повстречаться со всеми, приходите и 17,
            и 18&nbsp;июля.
          </p>

          <p>
            Билет — это QR-код, который придет вам на email после оплаты. При
            входе на фестиваль билет считывается и гасится, а вы получаете
            взамен браслет посетителя. С браслетом можно свободно входить и
            выходить с&nbsp;фестиваля. Браслет нельзя передавать другому человеку.
            Если вы потеряете браслет, то восстановить его будет нельзя.
          </p>
        </div>
        <button
          @click="toggleAccordion(6)"
          :class="{ 'faq-item-active': accordionIds.includes(6) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что дает покупка билета от определенного участника?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(6) }"
          class="faq-item__inner"
        >
          <p>
            Это форма поддержки участника фестиваля. Часть стоимости билета
            пойдет стримеру/подкастеру, по ссылке которого вы купили билет. В
            целом билет от участника ничем не отличается от билета, купленного с&nbsp;кнопки <a href="/#tickets" class="link">«Купить билет».</a>
          </p>

          <p>
            Однако участник фестиваля может дополнительно вознаградить тех
            поклонников, которые купили билеты с его страницы (но как именно и
            делать ли это вообще, участник решает сам).
          </p>
        </div>
        <button
          @click="toggleAccordion(7)"
          :class="{ 'faq-item-active': accordionIds.includes(7) }"
          class="faq-item"
        >
          <svg  class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Куда уходят личные данные, которые вводятся при покупке билета?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(7) }"
          class="faq-item__inner"
        >
          <p>
            Организаторы Стримфеста действуют в соответствии с ФЗ&nbsp;№152 «О
            персональных данных». Если вы покупаете обычный билет на Стримфест
            на один или два дня, ваши персональные данные не передаются третьим
            лицам.
          </p>

          <p>
            Если вы покупаете билет от конкретного
            <nuxt-link to="/stars" class="link">участника фестиваля</nuxt-link>,
            то этот участник получает ваши имя (но&nbsp;не&nbsp;фамилию) и email
            — так участник сможет узнать, кто именно купил от него билет(ы), и
            взаимодействовать с вами, если захочет.
          </p>
        </div>
        <button
          @click="toggleAccordion(8)"
          :class="{ 'faq-item-active': accordionIds.includes(8) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Какие возрастные ограничения?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(8) }"
          class="faq-item__inner"
        >
          <p>
            Подростки 14-16&nbsp;лет должны находиться на фестивале в постоянном
            сопровождении любого лица старше 18&nbsp;лет в соответствии с
            постановлением Правительства Москвы о массовых мероприятиях.
          </p>

          <p>
            Дети 8-13&nbsp;лет на фестиваль не допускаются в соответствии с
            требованиями площадки.
          </p>

          <p>
            Дети до 8&nbsp;лет должны находиться на фестивале в постоянном
            сопровождении своих родственников или опекунов в соответствии с ФЗ&nbsp;№124 (ст. 14).
          </p>
        </div>
        <button
          @click="toggleAccordion(9)"
          :class="{ 'faq-item-active': accordionIds.includes(9) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я собираюсь на Стримфест с маленьким ребенком, должен ли я
          платить за него?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(9) }"
          class="faq-item__inner"
        >
          <p>
            Если вы родитель ребенка до 8&nbsp;лет, то билет нужен только вам —
            ребенок сможет пройти на фестиваль бесплатно. Только не забудьте
            взять свидетельство о рождении ребенка — его могут спросить на
            входе.
          </p>
        </div>
        <button
          @click="toggleAccordion(10)"
          :class="{ 'faq-item-active': accordionIds.includes(10) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что можно и нельзя проносить на фестиваль?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(10) }"
          class="faq-item__inner"
        >
          <p>
            Нельзя проносить на Стримфест алкоголь, психотропные и наркотические
            вещества, бутафорское, холодное и огнестрельное оружие, а также
            любые предметы, которыми можно нанести урон жизни и здоровью.
            <a
              href="https://docs.google.com/document/d/1UiAIfANWzYRYZuGIW1sj3tAQ20-_AUEnvvgt8-xdPKQ/edit?ts=5e528e2f"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >Полные правила Технопарка «Сколково»</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(11)"
          :class="{ 'faq-item-active': accordionIds.includes(11) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Где там поесть?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(11) }"
          class="faq-item__inner"
        >
          <p>
            Прямо на фестивале работает столовая, где цены не кусаются. А также
            несколько кофеен, ресторан, продуктовый магазин.
          </p>
        </div>
        <button
          @click="toggleAccordion(12)"
          :class="{ 'faq-item-active': accordionIds.includes(12) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Как я могу участвовать в формировании программы фестиваля?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(12) }"
          class="faq-item__inner"
        >
          <p>
            Если вы хотите поучаствовать в работе лектория, выступить с
            интересным докладом или присоединиться к&nbsp;дискуссионным панелям,
            напишите на
            <a href="mailto:mike@streamfest.ru" class="link"
              >mike@streamfest.ru .</a>
          </p>
        </div>
        <div class="faq-item-last">
          <h3 class="faq-item">У меня остались вопросы!</h3>
          <p class="mobile-hidden">
            Прекрасно, задайте их личным сообщением в нашей

            <a
              href="https://vk.com/streamfest"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >группе VK</a
            >.
          </p>
          <a
            href="https://vk.com/streamfest"
            class="btn btn--vk desktop-hidden"
            target="_blank"
            rel="noopener noreferrer"
          ><span class="split">Задайте их в личку </span>
            <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M35.6791 25.8387C35.5824 25.681 34.9838 24.4146 32.1036 21.8118C29.0884 19.0863 29.4934 19.5289 33.1252 14.8162C35.3371 11.9461 36.2214 10.1933 35.9446 9.44401C35.6814 8.72977 34.0545 8.91819 34.0545 8.91819L28.6451 8.94886C28.6451 8.94886 28.2446 8.89628 27.9453 9.06936C27.655 9.24025 27.4683 9.63462 27.4683 9.63462C27.4683 9.63462 26.611 11.8562 25.4679 13.7448C23.0579 17.7301 22.0926 17.9404 21.6988 17.6929C20.783 17.1166 21.0125 15.3749 21.0125 14.1392C21.0125 10.2766 21.6133 8.66623 19.8402 8.24995C19.2507 8.11192 18.8186 8.0199 17.3133 8.00457C15.3826 7.98485 13.7468 8.01114 12.8219 8.45152C12.2054 8.7451 11.7306 9.40019 12.0209 9.43744C12.3787 9.48345 13.1887 9.64996 13.6185 10.2196C14.1743 10.9536 14.154 12.6055 14.154 12.6055C14.154 12.6055 14.4736 17.1517 13.4092 17.717C12.6779 18.1048 11.6766 17.3138 9.5277 13.6966C8.42737 11.8453 7.59481 9.79675 7.59481 9.79675C7.59481 9.79675 7.43505 9.41553 7.14928 9.21177C6.80275 8.9642 6.31672 8.88532 6.31672 8.88532L1.17284 8.91599C1.17284 8.91599 0.401032 8.9379 0.117511 9.26435C-0.134508 9.55575 0.0972595 10.1561 0.0972595 10.1561C0.0972595 10.1561 4.12506 19.3295 8.68389 23.9545C12.8669 28.194 17.6148 27.9157 17.6148 27.9157H19.766C19.766 27.9157 20.4163 27.8456 20.747 27.4973C21.053 27.1774 21.0418 26.5771 21.0418 26.5771C21.0418 26.5771 20.999 23.7661 22.3401 23.352C23.661 22.9445 25.3576 26.0688 27.1555 27.2716C28.5146 28.1808 29.5474 27.9815 29.5474 27.9815L34.356 27.9157C34.356 27.9157 36.8717 27.7646 35.6791 25.8387Z" fill="white"/>
          </svg>
          </a>
        </div>
      </div>
    </div>
    <Subscribe />
  </section>
</template>

<script>
import Subscribe from "@/components/Subscribe";

export default {
  components: {
    Subscribe
  },
  scrollToTop: true,
  data() {
    return {
      accordionIds: []
    };
  },
  methods: {
    toggleAccordion(id) {
      this.accordionIds = this.accordionIds.includes(id)
        ? this.accordionIds.filter(_id => _id != id)
        : [...this.accordionIds, id];
    }
  }
};
</script>
