<template>
  <section class="faq">
    <div class="pattern-bg "></div>
    <div class="faq-banner">
      <img src="/FAQ.png" alt="" loading="lazy" />
    </div>
    <div class="container">
      <p class="section-header">
        ПРО COVID-FREE И КОРОНАВИРУСНЫЕ ПРАВИЛА
      </p>
      <div class="faq-items">
        <button
          @click="toggleAccordion(1)"
          :class="{ 'faq-item-active': accordionIds.includes(1) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что такое COVID-free и почему Стримфест проходит в таком формате?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(1) }"
          class="faq-item__inner"
        >
          <p>
            Режим COVID-free — это вход по QR-коду, как сейчас в кафе и ресторанах. Такой формат делает фестиваль безопасным: можно не бояться подцепить коронавирус. Похоже, это новая норма для всех массовых мероприятий — согласно <a
              href="https://www.mos.ru/authority/documents/doc/46665220/"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >п. 23 указа Мэра Москвы</a
            > от 22 июня 2021 г. №35-УМ.
          </p>
          <p>Стримфест проходит в формате COVID-free, потому что он позволяет делать фестиваль безопасно и «как раньше»: без ограничений, без масок, перчаток и страха, зато с обнимашками, фудкортами и ресторанами.</p>
        </div>
        <button
          @click="toggleAccordion(2)"
          :class="{ 'faq-item-active': accordionIds.includes(2) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что значит и кому выдается QR-код?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(2) }"
          class="faq-item__inner"
        >
          <p>
            QR-код подтверждает, что человек не является носителями злосчастного вируса, и выдается в трех случаях:
          </p>
          <p>
            • тем, кто в последние 3 дня получил отрицательный результат ПЦР-теста в лаборатории, подключенной к службе emias.info;<br>
            • привитым от COVID-19 в России;<br>
            • переболевшим коронавирусом в последние 180 дней.
          </p>
        </div>
        <button
          @click="toggleAccordion(3)"
          :class="{ 'faq-item-active': accordionIds.includes(3) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Как получить QR-код?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(3) }"
          class="faq-item__inner"
        >
          <p>
            QR-код можно получить в электронной медицинской карте, на mos.ru, на emias.info и на портале «Госуслуги. Стоп коронавирус». Сейчас система работает хорошо, QR-код выдается автоматически:
          </p>
          <p>
            <b>— Если вы сдали ПЦР-тест</b> в организации, подключенной <a
              href="https://mosgorzdrav.ru/covid-test"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >к системе ЕМИАС</a
            >. QR-код на основе теста действует 72 часа, поэтому сдавать ПЦР-тест нужно в четверг, 5 августа.
          </p>
          <p>Если вам пришел результат теста, но не пришел QR-код, позвоните в лабораторию или поликлинику, где вы сдавали тест, сверьте свои паспортные данные и попросите заново отправить их в систему ЕМИАС.
</p>
<p><b>— Если вы сделали прививку.</b> QR-код выдается после полной вакцинации. Это значит, что первый укол прививки «Спутник V» и «Эпиваккорона» нужно сделать не позднее 15 июля, «Ковивака» — не позднее 23 июля, а «Спутника Лайт» — не позднее 4 августа.</p>
        <p>Если вы привились, а QR-кода все нет, то самый простой способ получить его — сходить в поликлинику, где вы прививались или к которой относитесь. Они тут же напечатают ваш QR-код прямо на ресепшене.</p>
        <p><b>— Если вы переболели в последние 180 дней.</b> QR-код выдается тем, кто болел «официально» — то есть обращался к врачу, сдавал мазок и числится в региональном или федеральном реестре переболевших. По справке об антителах QR-код получить нельзя.</p>
        <p>Если вы переболели, а QR-кода все нет, то самый простой способ получить его — сходить в поликлинику, к которой относитесь. Они тут же напечатают ваш QR-код прямо на ресепшене. 
</p>
<p>Еще больше информации по QR-кодам — <a
              href="https://www.m24.ru/news/gorod/24062021/170967"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >в FAQ Оперативного штаба Москвы</a
            >.</p>
        </div>
        <button
          @click="toggleAccordion(4)"
          :class="{ 'faq-item-active': accordionIds.includes(4) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Можно ли пройти по негативному ПЦР-тесту (не QR-коду, а именно тесту), справке об антителах, бумажному сертификату о вакцинации или сдать ПЦР-тест на месте?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(4) }"
          class="faq-item__inner"
        >
          <p>
            К сожалению, нет. Вход — только по QR-коду. По состоянию на 9 июля 2021 года Правительство Москвы запрещает принимать любые другие документы — даже те, по которым выдается сам QR-код. Основание — п. 23 указа Мэра Москвы от 22 июня 2021 г. №35-УМ. Но если у режима COVID-free случатся послабления, мы тут же напишем!
          </p>
        </div>
        <button
          @click="toggleAccordion(5)"
          :class="{ 'faq-item-active': accordionIds.includes(5) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что будет, если я приду на фестиваль без QR-кода?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(5) }"
          class="faq-item__inner"
        >
          <p>
            К сожалению, мы не сможем вас пропустить :( Это запрещает п. 23 указа Мэра Москвы от 22 июня 2021 г. №35-УМ. 
          </p>
          <p>
            Но есть и хорошие новости! Если вы не погасите билет 7 или 8 августа 2021, то вы сможете пройти по нему на Стримфест 2022. Билет продолжит действовать, просто станет невозвратным. Никаких дополнительных действий предпринимать не нужно.
          </p>
        </div>
        <button
          @click="toggleAccordion(6)"
          :class="{ 'faq-item-active': accordionIds.includes(6) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Где и когда делать ПЦР тест, чтобы получить QR-код до фестиваля?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(6) }"
          class="faq-item__inner"
        >
          <p>
            В четверг, 5 августа, вам нужно сдать ПЦР-тест в организации, подключенной <a
              href="https://mosgorzdrav.ru/covid-test"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >к системе ЕМИАС</a
            > — тогда результаты теста автоматически и максимально быстро попадут в систему и превратятся в QR-код.
          </p>
          <p>
            Если вы не из Москвы или не из России, вам нужно получить QR-код на сайте <a
              href="https://immune.mos.ru"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >https://immune.mos.ru</a
            > — мы проверяли, это просто и быстро.
          </p>
        </div>
        <button
          @click="toggleAccordion(7)"
          :class="{ 'faq-item-active': accordionIds.includes(7) }"
          class="faq-item"
        >
          <svg  class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я еду на Стримфест из другой страны. Как мне получить QR-код?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(7) }"
          class="faq-item__inner"
        >
          <p>
            Вам нужно прилететь в Россию и сдать ПЦР-тест в четверг, 5 августа, в организации, подключенной <a
              href="https://mosgorzdrav.ru/covid-test"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >к системе ЕМИАС</a
            > — тогда результаты теста автоматически попадут в систему, создающую QR-коды.
          </p>
          <p>
            Заказывая ПЦР-тест, обязательно скажите, что он нужен вам для QR-кода, и проверьте, что у вас из паспорта правильно переписали ФИО, дату рождения и паспортные данные. 
          </p>
          <p>Когда вы получите результаты ПЦР-теста, зайдите на сайт <a
              href="https://immune.mos.ru"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >https://immune.mos.ru</a
            > и заполните там ФИО, дату рождения, паспортные данные и номер телефона. Номер обязательно должен быть российским — в формате +7 9хх ххх-хх-хх (это может быть телефон знакомого, на него всего лишь придет смс-код). Номер патента на работу в РФ заполнять не обязательно!</p>
        <p>Подождите 10-15 секунд, пока система обработает запрос, найдет ваш ПЦР-тест и создаст QR-код. Если вам пришел результат теста, но система не создает QR-код, позвоните в лабораторию, где вы сдавали тест, сверьте свои данные и попросите заново отправить их в систему ЕМИАС.
</p>
        </div>
        <button
          @click="toggleAccordion(8)"
          :class="{ 'faq-item-active': accordionIds.includes(8) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Мне меньше 18 лет, нужно ли мне получать QR-код?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(8) }"
          class="faq-item__inner"
        >
          <p>
            Нет, вам не нужен QR-код — но обязательно нужно быть в присутствии сопровождающего старше 18 лет, у которого будет QR-код.
          </p>

          <p>
            Также на Стримфесте есть возрастные ограничения:<br>
            • подростки 14-17 лет должны находиться на фестивале в постоянном сопровождении любого лица старше 18 лет;<br>
            • дети 8-13 лет на фестиваль не допускаются в соответствии с требованиями площадки;<br>
            • дети до 8 лет должны находиться на фестивале в постоянном сопровождении родственников или опекунов.
          </p>
        </div>
        <button
          @click="toggleAccordion(9)"
          :class="{ 'faq-item-active': accordionIds.includes(9) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что будет, если я куплю билет, а потом заболею коронавирусом или ПЦР-тест будет положительным?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(9) }"
          class="faq-item__inner"
        >
          <p>
            Если вы не погасите билет 7 или 8 августа 2021, то вы сможете пройти по нему на Стримфест 2022. Билет продолжит действовать, просто станет невозвратным. Никаких дополнительных действий предпринимать не нужно.
          </p>
        </div>
      </div>
      <p class="section-header">
        ОБЩИЕ ВОПРОСЫ ПРО ФЕСТИВАЛЬ
      </p>
      <div class="faq-items">
        <button
          @click="toggleAccordion(10)"
          :class="{ 'faq-item-active': accordionIds.includes(10) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Где и когда пройдет Стримфест&nbsp;2021?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(10) }"
          class="faq-item__inner"
        >
          <p>
            Стримфест 2021 пройдет в
            <a
              href="https://sk.ru/"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >Технопарке «Сколково»</a
            >
            7 и 8&nbsp;августа с 11:00 до 19:00.
          </p>

          <p>
            К нам можно легко доехать на метро направления
            <a
              href="https://www.mos.ru/city/projects/diametry/"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >МЦД-1</a
            >
            (станция «Сколково»), а также на
            <a
              href="/contact"
              class="link"
              >такси, общественным и личным транспортом</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(11)"
          :class="{ 'faq-item-active': accordionIds.includes(11) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я стример или подкастер, как мне стать участником фестиваля?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(11) }"
          class="faq-item__inner"
        >
          <p>
            Проверьте, соответствуете ли вы критериям на странице
            <a
              href="/how-to"
              class="link"
              target="_blank"
            rel="noopener noreferrer"
              >Стать участником</a
            >, и напишите
            <a
              href="https://vk.com/mikhail_lisetskiy"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >организаторам в&nbsp;VK</a
            >
            или на
            <a href="mailto:mike@streamfest.ru" class="link"
              >mike@streamfest.ru</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(12)"
          :class="{ 'faq-item-active': accordionIds.includes(12) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я развиваюсь как стример, но канал пока небольшой. Можно мне
          билет на Стримфест?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(12) }"
          class="faq-item__inner"
        >
          <p>
            Да! Если вы регулярно стримите видеоигры и у вас больше 3000
            подписчиков на любой из стрим-платформ (Twitch.tv, YouTube, TikTok,
            VK, OK, WASD, Goodgame, BIGO Live), мы дадим вам бесплатный билет на
            оба дня фестиваля.
          </p>

          <p>
            Стримерам неигровых направлений мы даем билеты за меньшие цифры —
            достаточно 1000 подписчиков.
          </p>

          <p>
            Только проверим, что на канале нет накруток. Чтобы получить билет,
            <a
              href="https://vk.com/mikhail_lisetskiy"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >напишите организаторам в VK</a
            >
            или на&nbsp;<a href="mailto:info@streamfest.ru" class="link"
              >info@streamfest.ru</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(13)"
          :class="{ 'faq-item-active': accordionIds.includes(13) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что будет на Стримфесте?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(13) }"
          class="faq-item__inner"
        >
          <p>
            Стримфест — это большая развлекательная зона, главная и музыкальная
            сцены, лекторий, и все на одной площадке.
          </p>

          <p>
            В развлекательной зоне множество стендов со своими программами.
            Участники фестиваля будут стримить на виду у всех, проводить
            конкурсы, устраивать шоу. Стримеры и подкастеры постараются вас
            удивить. Будет весело! Здесь же можно поучаствовать в активностях от
            партнеров фестиваля, протестировать новинки игровой индустрии и
            технологии от резидентов «Сколково».
          </p>

          <p>
            Музыкальная сцена работает нон-стоп: вас ждут самые популярные
            поющие стримеры, стримеры-музыканты и приглашенные группы.
          </p>

          <p>
            На главной сцене состоятся шоу-матчи с участием известных
            прогеймеров, стримеров и простых зрителей. Там же пройдут дефиле
            косплееров, игровые презентации, жаркие дебаты и церемонии
            открытия/закрытия. </p>
            <p>В залах лектория — своя программа: полезные
            мастер-классы для начинающих и продвинутых стримеров/ подкастеров,
            встречи с руководителями стрим-платформ и не только. </p>
            <p>Мы подробнее
            расскажем о всех деталях программы ближе к Стримфесту. В мае на
            сайте появится подробное расписание лектория, а пока
            <a
              href="https://vk.com/streamfest"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >следите за новостями в группе VK</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(14)"
          :class="{ 'faq-item-active': accordionIds.includes(14) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Сколько стоят и чем отличаются билеты?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(14) }"
          class="faq-item__inner"
        >
          <p>
            У нас два типа билетов: билет на один день за 1300&nbsp;рублей и билет на
            оба дня за 2100&nbsp;рублей. Билет на один день позволяет посетить
            фестиваль или 7, или 8&nbsp;августа — на ваш выбор.
          </p>

          <p>
            Количество билетов ограничено, и чем ближе к Стримфесту, тем дороже
            они будут.
          </p>

          <p>
            Билеты можно <a class="link" href="/#tickets">купить здесь</a> или через страницу любимого
            <nuxt-link to="/stars" class="link"
              >стримера или подкастера</nuxt-link>
            — тогда он получит часть стоимости билета. Неважно, через кого
            покупать билет, увидеться можно будет со всеми участниками
            фестиваля. Однако некоторые участники будут на фестивале только один
            из дней — если хотите точно повстречаться со всеми, приходите и 7,
            и 8&nbsp;августа.
          </p>

          <p>
            Билет — это QR-код, который придет вам на email после оплаты. При
            входе на фестиваль билет считывается и гасится, а вы получаете
            взамен браслет посетителя. С браслетом можно свободно входить и
            выходить с&nbsp;фестиваля. Браслет нельзя передавать другому человеку.
            Если вы потеряете браслет, то восстановить его будет нельзя.
          </p>
        </div>
        <button
          @click="toggleAccordion(15)"
          :class="{ 'faq-item-active': accordionIds.includes(15) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что дает покупка билета от определенного участника?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(15) }"
          class="faq-item__inner"
        >
          <p>
            Это форма поддержки участника фестиваля. Часть стоимости билета
            пойдет стримеру/подкастеру, по ссылке которого вы купили билет. В
            целом билет от участника ничем не отличается от билета, купленного с&nbsp;кнопки <a href="/#tickets" class="link">«Купить билет».</a>
          </p>

          <p>
            Однако участник фестиваля может дополнительно вознаградить тех
            поклонников, которые купили билеты с его страницы (но как именно и
            делать ли это вообще, участник решает сам).
          </p>
        </div>
        <button
          @click="toggleAccordion(16)"
          :class="{ 'faq-item-active': accordionIds.includes(16) }"
          class="faq-item"
        >
          <svg  class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Куда уходят личные данные, которые вводятся при покупке билета?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(16) }"
          class="faq-item__inner"
        >
          <p>
            Организаторы Стримфеста действуют в соответствии с ФЗ&nbsp;№152 «О
            персональных данных». Если вы покупаете обычный билет на Стримфест
            на один или два дня, ваши персональные данные не передаются третьим
            лицам.
          </p>

          <p>
            Если вы покупаете билет от конкретного
            <nuxt-link to="/stars" class="link">участника фестиваля</nuxt-link>,
            то этот участник получает ваши имя (но&nbsp;не&nbsp;фамилию) и email
            — так участник сможет узнать, кто именно купил от него билет(ы), и
            взаимодействовать с вами, если захочет.
          </p>
        </div>
        <button
          @click="toggleAccordion(17)"
          :class="{ 'faq-item-active': accordionIds.includes(17) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Какие возрастные ограничения?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(17) }"
          class="faq-item__inner"
        >
          <p>
            Подростки 14-17&nbsp;лет должны находиться на фестивале в постоянном
            сопровождении любого лица старше 18&nbsp;лет в соответствии с
            постановлением Правительства Москвы о массовых мероприятиях.
          </p>

          <p>
            Дети 8-13&nbsp;лет на фестиваль не допускаются в соответствии с
            требованиями площадки.
          </p>

          <p>
            Дети до 8&nbsp;лет должны находиться на фестивале в постоянном
            сопровождении своих родственников или опекунов в соответствии с ФЗ&nbsp;№124 (ст. 14).
          </p>
        </div>
        <button
          @click="toggleAccordion(18)"
          :class="{ 'faq-item-active': accordionIds.includes(18) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Я собираюсь на Стримфест с маленьким ребенком, должен ли я
          платить за него?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(18) }"
          class="faq-item__inner"
        >
          <p>
            Если вы родитель ребенка до 8&nbsp;лет, то билет нужен только вам —
            ребенок сможет пройти на фестиваль бесплатно. Только не забудьте
            взять свидетельство о рождении ребенка — его могут спросить на
            входе.
          </p>
        </div>
        <button
          @click="toggleAccordion(19)"
          :class="{ 'faq-item-active': accordionIds.includes(19) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Что можно и нельзя проносить на фестиваль?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(19) }"
          class="faq-item__inner"
        >
          <p>
            Нельзя проносить на Стримфест алкоголь, психотропные и наркотические
            вещества, бутафорское, холодное и огнестрельное оружие, а также
            любые предметы, которыми можно нанести урон жизни и здоровью.
            <a
              href="https://docs.google.com/document/d/1UiAIfANWzYRYZuGIW1sj3tAQ20-_AUEnvvgt8-xdPKQ/edit?ts=5e528e2f"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >Полные правила Технопарка «Сколково»</a
            >.
          </p>
        </div>
        <button
          @click="toggleAccordion(20)"
          :class="{ 'faq-item-active': accordionIds.includes(20) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Где там поесть?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(20) }"
          class="faq-item__inner"
        >
          <p>
            Прямо на фестивале работает столовая, где цены не кусаются. А также
            несколько кофеен, ресторан, продуктовый магазин.
          </p>
        </div>
        <button
          @click="toggleAccordion(21)"
          :class="{ 'faq-item-active': accordionIds.includes(21) }"
          class="faq-item"
        >
          <svg class="faq-icon" width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#0060CF"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M19.3304 9.67198L16.4195 0.617977C16.2556 0.109311 15.6756 -0.0566894 15.3072 0.300644L12.6853 2.84598C11.7143 2.07398 8.12269 2.07398 7.15173 2.84598L4.52979 0.300644C4.1614 -0.0566894 3.58076 0.109311 3.41753 0.617977L0.506566 9.67198C-0.0889176 11.5246 0.672373 13.59 2.29173 14.4233C4.33753 15.476 6.92399 15.9673 9.91882 15.9673C12.913 15.9673 15.4995 15.476 17.5453 14.4233C19.1646 13.59 19.9259 11.5246 19.3304 9.67198Z" fill="#C4C4C4"/>
          </svg>
          Как я могу участвовать в формировании программы фестиваля?
          <svg class="faq-plus" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="14" y="5" width="2" height="20" rx="1" fill="#BAC8CF"/>
            <rect x="25" y="14" width="2" height="20" rx="1" transform="rotate(90 25 14)" fill="#BAC8CF"/>
          </svg>
        </button>
        <div
          :class="{ visible: accordionIds.includes(21) }"
          class="faq-item__inner"
        >
          <p>
            Если вы хотите поучаствовать в работе лектория, выступить с
            интересным докладом или присоединиться к&nbsp;дискуссионным панелям,
            напишите на
            <a href="mailto:mike@streamfest.ru" class="link"
              >mike@streamfest.ru</a>.
          </p>
        </div>
        <div class="faq-item-last">
          <h3 class="faq-item">У меня остались вопросы!</h3>
          <p class="mobile-hidden">
            Прекрасно, задайте их личным сообщением в нашей

            <a
              href="https://vk.com/streamfest"
              class="link"
              target="_blank"
              rel="noopener noreferrer"
              >группе VK</a
            >.
          </p>
          <a
            href="https://vk.com/streamfest"
            class="btn btn--vk desktop-hidden"
            target="_blank"
            rel="noopener noreferrer"
          >Задайте их в личку 
            <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M35.6791 25.8387C35.5824 25.681 34.9838 24.4146 32.1036 21.8118C29.0884 19.0863 29.4934 19.5289 33.1252 14.8162C35.3371 11.9461 36.2214 10.1933 35.9446 9.44401C35.6814 8.72977 34.0545 8.91819 34.0545 8.91819L28.6451 8.94886C28.6451 8.94886 28.2446 8.89628 27.9453 9.06936C27.655 9.24025 27.4683 9.63462 27.4683 9.63462C27.4683 9.63462 26.611 11.8562 25.4679 13.7448C23.0579 17.7301 22.0926 17.9404 21.6988 17.6929C20.783 17.1166 21.0125 15.3749 21.0125 14.1392C21.0125 10.2766 21.6133 8.66623 19.8402 8.24995C19.2507 8.11192 18.8186 8.0199 17.3133 8.00457C15.3826 7.98485 13.7468 8.01114 12.8219 8.45152C12.2054 8.7451 11.7306 9.40019 12.0209 9.43744C12.3787 9.48345 13.1887 9.64996 13.6185 10.2196C14.1743 10.9536 14.154 12.6055 14.154 12.6055C14.154 12.6055 14.4736 17.1517 13.4092 17.717C12.6779 18.1048 11.6766 17.3138 9.5277 13.6966C8.42737 11.8453 7.59481 9.79675 7.59481 9.79675C7.59481 9.79675 7.43505 9.41553 7.14928 9.21177C6.80275 8.9642 6.31672 8.88532 6.31672 8.88532L1.17284 8.91599C1.17284 8.91599 0.401032 8.9379 0.117511 9.26435C-0.134508 9.55575 0.0972595 10.1561 0.0972595 10.1561C0.0972595 10.1561 4.12506 19.3295 8.68389 23.9545C12.8669 28.194 17.6148 27.9157 17.6148 27.9157H19.766C19.766 27.9157 20.4163 27.8456 20.747 27.4973C21.053 27.1774 21.0418 26.5771 21.0418 26.5771C21.0418 26.5771 20.999 23.7661 22.3401 23.352C23.661 22.9445 25.3576 26.0688 27.1555 27.2716C28.5146 28.1808 29.5474 27.9815 29.5474 27.9815L34.356 27.9157C34.356 27.9157 36.8717 27.7646 35.6791 25.8387Z" fill="white"/>
          </svg>
          </a>
        </div>
      </div>
    </div>
    <Subscribe />
  </section>
</template>

<script>
import Subscribe from "@/components/Subscribe";

export default {
  components: {
    Subscribe
  },
  scrollToTop: true,
  data() {
    return {
      accordionIds: []
    };
  },
  methods: {
    toggleAccordion(id) {
      this.accordionIds = this.accordionIds.includes(id)
        ? this.accordionIds.filter(_id => _id != id)
        : [...this.accordionIds, id];
    }
  }
};
</script>
