<template>
  <div>
    <section class="offer">
      <video class="offer-video" :src="mainVideoSrc" loop autoplay muted />
      <div class="container offer-wrapper">
        <h3 class="offer__title">СТРИМФЕСТ 2021</h3>
        <p class="offer__subtitle">Главный фестиваль стримеров!</p>
        <p class="offer__subtitle subtitle-last">
          7–8 августа<br />Москва, Сколково
        </p>
        <p class="offer__22px">до фестиваля</p>
        <p class="offer__36px">{{ lastDay }}</p>
        <nuxt-link
          @click.native="handleScroll"
          class="btn header__button btn--big btn--yellow"
          to="#tickets"
        >
          Купить билет
        </nuxt-link>
      </div>
    </section>
    <section class="video-block">
      <div class="container">
        <h3 class="section-header mb-20">
          ВСЕ ЗВЁЗДЫ И&nbsp;ЖАНРЫ&nbsp;СТРИМИНГА
        </h3>
        <p class="section-subheader">
          Стримфест — это крупнейший в СНГ фестиваль стрим-культуры.
          Здесь&nbsp;известные&nbsp;стримеры&nbsp;и подкастеры встречаются со
          своими зрителями. <br />
          Живое общение, море развлечений, мастер-классы&nbsp;— без сомнения,
          лучшие выходные года!
        </p>
        <div style="padding:56.25% 0 0 0;position:relative;">
          <iframe
            src="https://player.vimeo.com/video/530958754?title=0&byline=0&portrait=0"
            loading="lazy"
            style="position:absolute;top:0;left:0;width:100%;height:100%;"
            frameborder="0"
            allow="autoplay; fullscreen; picture-in-picture"
            allowfullscreen
          ></iframe>
        </div>
        <div class="video-wrapper">
          <div class="video-item">
            <img src="/cats/s_1.svg" loading="lazy"/>
            <div class="video-item__title">Встречи со звездами</div>
            <p>
              Топы всех платформ: Twitch.tv, YouTube, TikTok, WASD, Goodgame, VK
              и OK.
            </p>
          </div>
          <div class="video-item">
            <img src="/cats/s_2.svg" loading="lazy"/>
            <div class="video-item__title">Игровые зоны и конкурсы</div>
            <p>
              Развлечения по полной: видеоигры, роботы, танцы, фотозоны и призы.
            </p>
          </div>
          <div class="video-item">
            <img src="/cats/s_3.svg" loading="lazy"/>
            <div class="video-item__title">Турниры и шоу-матчи</div>
            <p>
              MOBA, шутеры и батл рояли — участвуй сам и смотри, как жарят
              киберкотлеты!
            </p>
          </div>
          <div class="video-item">
            <img src="/cats/s_4.svg" loading="lazy"/>
            <div class="video-item__title">Настолки и застолья</div>
            <p>
              Тащи друзей в партию или в кафешки, там всё вкусно и по карману.
            </p>
          </div>
          <div class="video-item">
            <img src="/cats/s_5.svg" loading="lazy"/>
            <div class="video-item__title">Дефиле косплееров</div>
            <p>
              Самый демократичный конкурс фанатского костюма — портал
              открывается!
            </p>
          </div>
          <div class="video-item">
            <img src="/cats/s_6.svg" loading="lazy"/>
            <div class="video-item__title">Лекции и мастер-классы</div>
            <p>
              Два дня интенсива: прокачаем скиллы, научим зарабатывать на
              стримах.
            </p>
          </div>
        </div>
        <div class="video-buttons">
          <a class="video-button btn-disable btn btn--blue">
            <svg
              class="btn--icon"
              width="54"
              height="53"
              viewBox="0 0 54 53"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d)">
                <path
                  d="M15.8503 23.3961C15.8218 23.3961 15.7933 23.3951 15.7645 23.3934L3.37532 22.6199C2.90394 22.5907 2.48097 22.3212 2.25506 21.9068C2.0295 21.4924 2.03224 20.9908 2.26296 20.5788C2.32784 20.4628 3.88928 17.7096 6.8628 15.3084C10.881 12.064 15.5523 11.0118 20.3712 12.2656C20.7712 12.3696 21.1028 12.6484 21.2745 13.0243C21.4461 13.4003 21.4393 13.8335 21.2556 14.2036L17.0804 22.6326C16.8477 23.1022 16.3694 23.3961 15.8503 23.3961Z"
                  fill="#FF5B5B"
                />
                <path
                  d="M25.8379 45C25.612 45 25.3861 44.9444 25.1812 44.8325C24.7668 44.6066 24.4973 44.1839 24.4677 43.7125L23.6946 31.3234C23.6602 30.7717 23.96 30.2529 24.4554 30.0074L32.8843 25.832C33.2548 25.6486 33.6877 25.6418 34.0636 25.8134C34.4399 25.9847 34.7183 26.3167 34.8224 26.7167C36.0765 31.5356 35.0242 36.2068 31.7795 40.2251C29.3786 43.1986 26.6252 44.7597 26.5091 44.8249C26.3007 44.9416 26.0693 45 25.8379 45Z"
                  fill="#FF193D"
                />
                <path
                  d="M44.8855 11.0794L36.0085 2.20241C35.6528 1.84673 35.131 1.71421 34.6486 1.85668C28.706 3.6145 23.8278 6.37138 20.1484 10.0504C19.381 10.8181 18.6439 11.65 17.958 12.5227C15.9633 15.0588 14.2971 18.0574 13.0062 21.4354C12.184 23.5883 11.5145 25.8948 11.0163 28.2905C10.1463 32.4753 10.0997 35.4745 10.0979 35.6002C10.0935 35.9699 10.2384 36.3263 10.5 36.5879C10.7575 36.8454 11.107 36.9899 11.4709 36.9899H11.4877C11.6137 36.9886 14.613 36.9419 18.7974 36.0719C21.1931 35.5737 23.4995 34.9043 25.6529 34.0817C29.0305 32.7908 32.0291 31.125 34.5645 29.1306C35.4379 28.4443 36.2698 27.7072 37.0375 26.9395C40.7168 23.2601 43.4737 18.3818 45.2312 12.4393C45.374 11.9569 45.2412 11.4351 44.8855 11.0794Z"
                  fill="#E1F1FA"
                />
                <path
                  d="M19.7354 34.0034L13.0845 27.3526C12.5936 26.8616 11.8132 26.8146 11.2666 27.2431C10.842 27.5761 10.4379 27.9338 10.0657 28.306C5.43805 32.9336 5.29488 40.1039 5.29111 40.4067C5.2863 40.7769 5.43118 41.1332 5.69314 41.3948C5.95063 41.6527 6.29979 41.7972 6.66371 41.7972C6.66955 41.7972 6.67538 41.7972 6.68122 41.7969C6.98403 41.7931 14.1547 41.6499 18.782 37.0223C19.1541 36.6501 19.5119 36.246 19.8449 35.8213C20.2734 35.2748 20.2263 34.4944 19.7354 34.0034Z"
                  fill="#FFF261"
                />
                <path
                  d="M13.1123 21.1607L9.03192 25.2414C8.77443 25.4986 8.62955 25.8477 8.62955 26.212C8.62955 26.5759 8.77443 26.9251 9.03192 27.1826L19.9053 38.0559C20.1624 38.3134 20.5116 38.458 20.8759 38.458C21.2401 38.458 21.5889 38.3134 21.8464 38.0559L25.9268 33.9755L13.1123 21.1607Z"
                  fill="#1B3B6B"
                />
                <path
                  d="M30.9249 20.3512C29.8064 20.3512 28.7545 19.9155 27.9634 19.1245C26.3306 17.4916 26.3306 14.835 27.9634 13.2018C28.7545 12.4108 29.8064 11.9751 30.9249 11.9751C32.0435 11.9751 33.0954 12.4108 33.8864 13.2018C34.6774 13.9928 35.1131 15.0444 35.1131 16.1633C35.1131 17.2818 34.6774 18.3334 33.8864 19.1245C33.0954 19.9155 32.0435 20.3512 30.9249 20.3512Z"
                  fill="#06CCAB"
                />
                <path
                  d="M30.9246 21.6939C29.4473 21.6939 28.0585 21.1185 27.0141 20.0741C24.8577 17.9177 24.8577 14.4089 27.0141 12.2525C28.0585 11.2081 29.4476 10.6327 30.9246 10.6327C32.4019 10.6327 33.7906 11.2081 34.8354 12.2525C35.8801 13.2973 36.4552 14.686 36.4552 16.1633C36.4552 17.6406 35.8801 19.0294 34.8354 20.0741C33.7906 21.1185 32.4019 21.6939 30.9246 21.6939ZM30.9246 13.3783C30.1809 13.3783 29.4812 13.668 28.9553 14.194C27.8697 15.2799 27.8697 17.0467 28.9553 18.1326C29.4812 18.6586 30.1809 18.9483 30.9246 18.9483C31.6686 18.9483 32.3679 18.6586 32.8939 18.1326C33.4199 17.6066 33.7096 16.9073 33.7096 16.1633C33.7096 15.4193 33.4199 14.72 32.8939 14.194C32.3679 13.668 31.6686 13.3783 30.9246 13.3783Z"
                  fill="#1B3B6B"
                />
                <path
                  d="M46.6859 0.402376C46.4239 0.14042 46.0655 -0.00686538 45.6974 0.000344403C45.4938 0.00274766 40.641 0.0844585 34.6486 1.85669L45.2312 12.4393C47.0034 6.44692 47.0851 1.59405 47.0875 1.39046C47.0924 1.02036 46.9475 0.663988 46.6859 0.402376Z"
                  fill="#FF5B5B"
                />
                <path
                  d="M44.8855 11.0794L40.447 6.6409L10.5 36.5879C10.7575 36.8454 11.1066 36.99 11.4706 36.99H11.4877C11.6134 36.9886 14.6126 36.9419 18.7974 36.0719C21.1931 35.5737 23.4992 34.9043 25.6525 34.0817C29.0305 32.7908 32.0291 31.125 34.5645 29.1306C35.4376 28.4443 36.2698 27.7072 37.0371 26.9395C40.7165 23.2601 43.4734 18.3819 45.2309 12.4393C45.374 11.9569 45.2412 11.4351 44.8855 11.0794Z"
                  fill="#CDEBFC"
                />
                <path
                  d="M19.7354 34.0034L16.4099 30.6779L5.69276 41.3948V41.3951C5.9506 41.6526 6.29976 41.7972 6.66368 41.7972H6.68084C6.984 41.7934 14.1543 41.6499 18.7819 37.0222C19.1541 36.6501 19.5119 36.246 19.8445 35.8213C20.2733 35.2747 20.2267 34.4943 19.7354 34.0034Z"
                  fill="#FDBF00"
                />
                <path
                  d="M19.5197 27.5681L14.4684 32.6195L19.9053 38.0563C20.1624 38.3135 20.5116 38.4583 20.8758 38.4583C21.2401 38.4583 21.5889 38.3135 21.8464 38.0563L25.9268 33.9756L19.5197 27.5681Z"
                  fill="#001035"
                />
                <path
                  d="M33.8864 13.2018C33.8861 13.2018 33.8861 13.2018 33.8861 13.2018L27.9634 19.1245H27.9638C28.7544 19.9155 29.8064 20.3511 30.9249 20.3511C32.0435 20.3511 33.0954 19.9155 33.8864 19.1245C34.6774 18.3334 35.1131 17.2818 35.1131 16.1633C35.1128 15.0447 34.6774 13.9928 33.8864 13.2018Z"
                  fill="#1CADB5"
                />
                <path
                  d="M34.8354 12.2525L32.8939 14.194C33.4199 14.72 33.7097 15.4193 33.7097 16.1633C33.7097 16.9073 33.4199 17.6066 32.8939 18.1326C32.3679 18.6586 31.6686 18.9483 30.9246 18.9483C30.1806 18.9483 29.4813 18.6586 28.9553 18.1326C28.9553 18.1326 28.9553 18.1326 28.9553 18.1322L27.0138 20.0737V20.0741C28.0585 21.1185 29.4473 21.6939 30.9246 21.6939C32.4019 21.6939 33.7907 21.1185 34.8354 20.0741C35.8798 19.0293 36.4552 17.6406 36.4552 16.1633C36.4552 14.686 35.8798 13.2972 34.8354 12.2525Z"
                  fill="#001035"
                />
                <path
                  d="M46.6855 0.402039L39.9399 7.14799L45.2312 12.4393C47.0034 6.44693 47.0851 1.59406 47.0876 1.39047C47.0924 1.02036 46.9475 0.663994 46.6855 0.402039Z"
                  fill="#FF193D"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d"
                  x="0"
                  y="0"
                  width="53.0877"
                  height="53"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  />
                  <feOffset dx="2" dy="4" />
                  <feGaussianBlur stdDeviation="2" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow"
                    result="shape"
                  />
                </filter>
              </defs>
            </svg>

            И другие активности</a
          >
          <a class="video-button btn-disable btn btn--blue">
            <svg
              class="btn--icon"
              width="53"
              height="51"
              viewBox="0 0 53 51"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d)">
                <path
                  d="M46.9895 41.8083L43.4542 22.3308C43.4189 22.1363 43.2984 21.9679 43.1256 21.8719L34.2273 16.9227C34.1118 16.8584 33.9824 16.8328 33.8552 16.8427L35.4741 37.7262L35.4198 37.7505L46.069 42.528C46.1557 42.5667 46.2478 42.5859 46.3395 42.5859C46.4846 42.5859 46.6284 42.5382 46.7466 42.4456C46.9398 42.2948 47.0332 42.0494 46.9895 41.8083Z"
                  fill="#44C868"
                />
                <path
                  d="M24.5001 21.6541L15.3994 16.9141C15.2903 16.8572 15.1694 16.834 15.0503 16.842C15.0819 16.8401 15.1136 16.8402 15.1451 16.8427L13.5262 37.7262L24.2296 42.5281C24.316 42.5667 24.4082 42.586 24.5001 42.586V21.6541Z"
                  fill="#44C868"
                />
                <path
                  d="M15.1449 16.8427C15.0178 16.8329 14.8883 16.8585 14.7728 16.9227L5.87449 21.8719C5.7017 21.9679 5.58111 22.1362 5.54587 22.3307L2.01064 41.8083C1.96687 42.0493 2.06038 42.2947 2.25348 42.4457C2.37187 42.5382 2.51557 42.586 2.66059 42.586C2.75226 42.586 2.84446 42.5669 2.93103 42.528L13.5222 37.7766L15.1449 16.8427Z"
                  fill="#4CE166"
                />
                <path
                  d="M33.8551 16.8423C33.7675 16.8491 33.6809 16.8723 33.6007 16.9142L24.5 21.6541V42.586C24.5 42.586 24.5 42.586 24.5001 42.586C24.592 42.586 24.6843 42.5669 24.7706 42.5281L35.474 37.7263L33.8551 16.8423Z"
                  fill="#4CE166"
                />
                <path
                  d="M4.47451 28.2335L3.75636 32.1902L14.3906 26.5735L14.6375 23.3884L14.6785 22.8602L4.47451 28.2335Z"
                  fill="#FFDB56"
                />
                <path
                  d="M14.4863 25.3384L14.3906 26.5735L3.75632 32.1902L2.01064 41.8084C1.96687 42.0494 2.06038 42.2948 2.25348 42.4458C2.37187 42.5383 2.51557 42.586 2.66059 42.586C2.75226 42.586 2.84446 42.567 2.93103 42.5281L13.5222 37.7767L14.4863 25.3384Z"
                  fill="#A8EEFC"
                />
                <path
                  d="M24.5027 24.265L14.6784 22.8602L14.3906 26.5735L24.5001 41.9262V36.3436L18.4675 26.8445L24.5027 27.5663V24.265Z"
                  fill="#FFBB24"
                />
                <path
                  d="M42.425 21.4824L38.1504 19.1049L34.1038 20.0504L34.1544 20.7039L34.3542 23.2821L42.425 21.4824Z"
                  fill="#FFBB24"
                />
                <path
                  d="M34.7131 27.9119L34.3299 22.9682L34.1038 20.0503L24.5027 24.2648V27.5662L30.7742 24.8389L34.7131 27.9119Z"
                  fill="#FFDB56"
                />
                <path
                  d="M46.9894 41.8084L46.1015 36.9159L34.3543 23.2822L34.7132 27.9121L46.7604 42.4335C46.9436 42.2817 47.0321 42.0433 46.9894 41.8084Z"
                  fill="#FFBB24"
                />
                <path
                  d="M24.5424 2.41388C19.4479 2.41388 15.3033 6.55512 15.3033 11.6454C15.3033 14.7942 16.7982 18.1748 19.7467 21.6933C21.9122 24.2775 24.0483 25.9396 24.1382 26.0091C24.2572 26.1012 24.3998 26.1471 24.5424 26.1471C24.685 26.1471 24.8276 26.1012 24.9467 26.0091C25.0365 25.9396 27.1727 24.2775 29.3382 21.6933C32.2867 18.1748 33.7816 14.7943 33.7816 11.6454C33.7814 6.55512 29.6368 2.41388 24.5424 2.41388ZM27.9639 11.6453C27.9639 13.5334 26.432 15.0641 24.5424 15.0641C22.6527 15.0641 21.1208 13.5335 21.1208 11.6453C21.1208 9.75716 22.6527 8.22654 24.5424 8.22654C26.432 8.22654 27.9639 9.75724 27.9639 11.6453Z"
                  fill="#FF4A4A"
                />
                <path
                  d="M24.5423 2.41388C24.1386 2.41388 23.7408 2.44007 23.3506 2.49052C27.8843 3.07649 31.3981 6.95854 31.3981 11.6454C31.3981 14.7942 29.9031 18.1748 26.9547 21.6933C25.562 23.3551 24.1826 24.6347 23.3507 25.3556C23.8125 25.7557 24.1062 25.9843 24.1382 26.0091C24.2572 26.1012 24.3998 26.1471 24.5424 26.1471C24.685 26.1471 24.8276 26.1012 24.9466 26.0091C25.0364 25.9396 27.1726 24.2775 29.3382 21.6933C32.2866 18.1748 33.7816 14.7943 33.7816 11.6454C33.7814 6.55512 29.6367 2.41388 24.5423 2.41388Z"
                  fill="#E7343F"
                />
                <path
                  d="M24.7706 42.5281L28.7507 40.7425L24.5001 36.3434V42.586C24.5001 42.586 24.5001 42.586 24.5001 42.586C24.592 42.586 24.6842 42.5669 24.7706 42.5281Z"
                  fill="#FFDB56"
                />
                <path
                  d="M43.454 22.3307C43.4188 22.1363 43.2982 21.9679 43.1254 21.8719L42.4249 21.4822L34.3542 23.282L46.1013 36.9157L43.454 22.3307Z"
                  fill="#1EA4E9"
                />
                <path
                  d="M24.4999 42.5859C24.5 42.5859 24.5 42.5859 24.4999 42.5859V41.926L14.3906 26.5734L13.526 37.7263L24.2294 42.5281C24.3158 42.5669 24.408 42.5859 24.4999 42.5859Z"
                  fill="#1EA4E9"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d"
                  x="0"
                  y="0"
                  width="53.0001"
                  height="53"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  />
                  <feOffset dx="2" dy="4" />
                  <feGaussianBlur stdDeviation="2" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow"
                    result="shape"
                  />
                </filter>
              </defs>
            </svg>
            Карта фестиваля</a
          >
          <a class="video-button btn-disable btn btn--blue">
            <svg
              class="btn--icon"
              width="53"
              height="53"
              viewBox="0 0 53 53"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d)">
                <path
                  d="M41.2796 42.7119L45.0108 42.7118C45.4753 42.7133 45.9176 42.513 46.2229 42.1629C46.5282 41.8128 46.6664 41.3474 46.6018 40.8874L42.0423 9.15253L41.2796 42.7119Z"
                  fill="#F29C1F"
                />
                <path
                  d="M39.7542 3.8136H4.66949C3.40578 3.8136 2.38135 4.83803 2.38135 6.10173V42.7119C2.38135 43.9756 3.40578 45 4.66949 45H39.7542C41.0179 45 42.0424 43.9756 42.0424 42.7119V6.10173C42.0424 4.83803 41.0179 3.8136 39.7542 3.8136Z"
                  fill="#F0C419"
                />
                <path
                  d="M38.9915 8.38986V12.9661H5.43221V8.38986C5.43472 7.54844 6.11621 6.86695 6.95764 6.86444H37.4661C38.3075 6.86695 38.989 7.54844 38.9915 8.38986Z"
                  fill="#E64C3C"
                />
                <path
                  d="M38.9915 12.9661V35.9771C38.9914 36.3836 38.8294 36.7733 38.5415 37.0602L34.1026 41.4992C33.8156 41.7871 33.426 41.949 33.0195 41.9492H6.95764C6.11621 41.9467 5.43472 41.2652 5.43221 40.4238V12.9661H38.9915Z"
                  fill="#ECF0F1"
                />
                <path
                  d="M16.1102 33.5594C18.6365 33.5568 20.6839 31.5094 20.6864 28.9831V22.8814C20.6864 20.354 18.6376 18.3051 16.1102 18.3051C13.5827 18.3051 11.5339 20.354 11.5339 22.8814V28.9831C11.5364 31.5094 13.5838 33.5568 16.1102 33.5594ZM13.0593 22.8814C13.0593 21.1964 14.4252 19.8305 16.1102 19.8305C17.7951 19.8305 19.161 21.1964 19.161 22.8814V28.9831C19.161 30.668 17.7951 32.0339 16.1102 32.0339C14.4252 32.0339 13.0593 30.668 13.0593 28.9831V22.8814Z"
                  fill="#547580"
                />
                <path
                  d="M24.5 32.0339C24.0788 32.0339 23.7373 32.3754 23.7373 32.7966C23.7373 33.2179 24.0788 33.5593 24.5 33.5593H30.6017C31.0229 33.5593 31.3644 33.2179 31.3644 32.7966C31.3644 32.3754 31.0229 32.0339 30.6017 32.0339H28.3135V19.0678C28.3135 18.7594 28.1277 18.4813 27.8427 18.3633C27.5577 18.2453 27.2297 18.3105 27.0116 18.5286L23.9608 21.5794C23.6717 21.8787 23.6758 22.3544 23.97 22.6486C24.2642 22.9428 24.74 22.9469 25.0392 22.6579L26.7881 20.909V32.0339H24.5Z"
                  fill="#547580"
                />
                <path
                  d="M30.6017 35.8475H13.0593C12.6381 35.8475 12.2966 36.189 12.2966 36.6102C12.2966 37.0314 12.6381 37.3729 13.0593 37.3729H30.6017C31.0229 37.3729 31.3644 37.0314 31.3644 36.6102C31.3644 36.189 31.0229 35.8475 30.6017 35.8475Z"
                  fill="#35495E"
                />
                <path
                  d="M38.8542 36.6102C38.7778 36.7777 38.6718 36.9301 38.5415 37.0602L34.1025 41.4992C33.9724 41.6295 33.82 41.7354 33.6525 41.8119V38.1356C33.655 37.2942 34.3365 36.6127 35.1779 36.6102H38.8542Z"
                  fill="#D1D4D1"
                />
                <path
                  d="M20.4271 3.81357H18.833C18.0707 2.06681 16.1358 1.15106 14.3016 1.66893C12.4675 2.18681 11.2972 3.97928 11.561 5.86682C11.8248 7.75435 13.4416 9.15734 15.3475 9.15255C15.7687 9.15255 16.1102 9.49403 16.1102 9.91527C16.1102 10.3365 15.7687 10.678 15.3475 10.678C12.6319 10.6783 10.3487 8.6402 10.042 5.94203C9.73528 3.24385 11.5028 0.745288 14.1491 0.136092C16.7954 -0.473103 19.4775 1.00117 20.3814 3.56188C20.4119 3.64226 20.4274 3.72758 20.4271 3.81357Z"
                  fill="#95A5A5"
                />
                <path
                  d="M34.9186 3.81357H33.3246C32.5622 2.06681 30.6273 1.15106 28.7932 1.66893C26.959 2.18681 25.7888 3.97928 26.0525 5.86682C26.3163 7.75435 27.9331 9.15734 29.839 9.15255C30.2602 9.15255 30.6017 9.49403 30.6017 9.91527C30.6017 10.3365 30.2602 10.678 29.839 10.678C27.1234 10.6783 24.8402 8.6402 24.5335 5.94203C24.2268 3.24385 25.9943 0.745288 28.6406 0.136092C31.287 -0.473103 33.969 1.00117 34.8729 3.56188C34.9034 3.64226 34.919 3.72758 34.9186 3.81357Z"
                  fill="#95A5A5"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d"
                  x="0"
                  y="-0.000793457"
                  width="53"
                  height="53.0008"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                  />
                  <feOffset dx="2" dy="4" />
                  <feGaussianBlur stdDeviation="2" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow"
                    result="shape"
                  />
                </filter>
              </defs>
            </svg>
            Расписание</a
          >
        </div>
      </div>
      <div class="side-parts">
        <img src="/side-parts_1.svg" loading="lazy" />
        <img src="/side-parts_2.svg" loading="lazy" />
      </div>
    </section>
    <div class="separator">
      <svg
        class="faq-icon"
        width="20"
        height="16"
        viewBox="0 0 20 16"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g clip-path="url(#clip1)">
          <path
            d="M8.54894 0.927052C8.8483 0.0057416 10.1517 0.00573945 10.4511 0.92705L11.6329 4.56434C11.7668 4.97636 12.1507 5.25532 12.5839 5.25532H16.4084C17.3771 5.25532 17.7799 6.49494 16.9962 7.06434L13.9021 9.31231C13.5516 9.56695 13.405 10.0183 13.5389 10.4303L14.7207 14.0676C15.02 14.9889 13.9656 15.7551 13.1818 15.1857L10.0878 12.9377C9.7373 12.6831 9.2627 12.6831 8.91222 12.9377L5.81815 15.1857C5.03444 15.7551 3.97996 14.9889 4.27931 14.0676L5.46114 10.4303C5.59501 10.0183 5.44835 9.56695 5.09787 9.31231L2.00381 7.06434C1.22009 6.49494 1.62287 5.25532 2.59159 5.25532H6.41606C6.84929 5.25532 7.23324 4.97636 7.36712 4.56434L8.54894 0.927052Z"
            fill="#0D6DD8"
          />
        </g>
        <defs>
          <clipPath id="clip1">
            <rect width="20" height="16" fill="white" />
          </clipPath>
        </defs>
      </svg>
    </div>
    <section class="streamers">
      <div class="container">
        <h3 class="section-header">ОЧЕНЬ ПРОСТО ПОВСТРЕЧАТЬ</h3>
        <div class="streamers-wrapper">
          <StreamerCard
            v-for="{ id, photo, name, nickNameSlug, nickName } in streamers"
            :key="id"
            :image="photo"
            :name="name"
            :name_slug="nickNameSlug"
            :nickname="nickName"
          />
        </div>
        <StreamersSwiper :streamers="streamers" />
        <div class="streamers-btn">
          <img class="btn--icon" src="/smile.png" loading="lazy"/>
          <nuxt-link class="btn btn-w-icon btn--blue" to="/stars"
            >КТО ТОЛЬКО НЕ ПРИДЕТ
          </nuxt-link>
        </div>
      </div>
    </section>
    <section class="tickets">
      <div id="tickets"></div>
      <h3 class="section-header">
        ЦЕНЫ ВЫРАСТУТ&nbsp;— БЕРИ БИЛЕТ СЕЙЧАС!
      </h3>
      <div class="tickets-wrapper">
        <div class="tickets-desktop">
          <div
            class="tickets-item"
            v-for="{ id, days_qty, price } in tickets"
            :key="id"
          >
            <div class="tickets-item__wrapper">
              <p v-if="days_qty === 1" class="tickets-item__days">
                Билет на один день 7&nbsp;или&nbsp;8&nbsp;августа
              </p>
              <p v-else class="tickets-item__days">
                Билет на оба дня 7&nbsp;и&nbsp;8&nbsp;августа
              </p>
              <ul v-if="days_qty === 1" class="tickets-item__list">
                <li class="tickets-item__list--item checked">
                  Хайп, веселье, конкурсы
                </li>
                <li class="tickets-item__list--item checked">
                  Все стенды и развлечения
                </li>
                <li class="tickets-item__list--item ">
                  Все стримеры и подкастеры
                </li>
                <li class="tickets-item__list--item ">
                  Все лекции и мастер-классы
                </li>
                <li class="tickets-item__list--item ">Два дня праздника</li>
              </ul>
              <ul v-else class="tickets-item__list">
                <li class="tickets-item__list--item checked">
                  Хайп, веселье, конкурсы
                </li>
                <li class="tickets-item__list--item checked">
                  Все стенды и развлечения
                </li>
                <li class="tickets-item__list--item checked">
                  Все стримеры и подкастеры
                </li>
                <li class="tickets-item__list--item checked">
                  Все лекции и мастер-классы
                </li>
                <li class="tickets-item__list--item checked">
                  Два дня праздника
                </li>
              </ul>
            </div>
            <div class="tickets-item__bottom">
              <p class="tickets-item__price">
                <span>{{ price }} ₽</span>
              </p>
              <button
                v-if="days_qty === 1"
                @click="addItem(id)"
                class="btn btn-ticket btn--red"
                id="homeTicketOne"
              >
                Купить билет на 1 день
              </button>
              <button
                v-else
                @click="addItem(id)"
                class="btn btn-ticket btn--red"
                id="homeTicketTwo"
              >
                Купить билет на 2 дня
              </button>
            </div>
          </div>
        </div>
        <div class="tickets-mobile">
          <client-only>
            <swiper
              :options="ticketsOptions"
              ref="ticketsSwiper"
              @click.native="ticketsSwiperClick"
            >
              <swiper-slide
                v-for="{ id, days_qty, price } in tickets"
                :key="id"
                :data-ticket-id="id"
              >
                <div class="tickets-item">
                  <div class="tickets-item__wrapper">
                    <p v-if="days_qty === 1" class="tickets-item__days">
                Билет на один день 7&nbsp;или&nbsp;8&nbsp;августа
              </p>
              <p v-else class="tickets-item__days">
                Билет на оба дня 7&nbsp;и&nbsp;8&nbsp;августа
              </p>
                    <ul v-if="days_qty === 1" class="tickets-item__list">
                      <li class="tickets-item__list--item checked">
                        Хайп, веселье, конкурсы
                      </li>
                      <li class="tickets-item__list--item checked">
                        Все стенды и развлечения
                      </li>
                      <li class="tickets-item__list--item ">
                        Все стримеры и подкастеры
                      </li>
                      <li class="tickets-item__list--item ">
                        Все лекции и мастер-классы
                      </li>
                      <li class="tickets-item__list--item ">
                        Два дня праздника
                      </li>
                    </ul>
                    <ul v-else class="tickets-item__list">
                      <li class="tickets-item__list--item checked">
                        Хайп, веселье, конкурсы
                      </li>
                      <li class="tickets-item__list--item checked">
                        Все стенды и развлечения
                      </li>
                      <li class="tickets-item__list--item checked">
                        Все стримеры и подкастеры
                      </li>
                      <li class="tickets-item__list--item checked">
                        Все лекции и мастер-классы
                      </li>
                      <li class="tickets-item__list--item checked">
                        Два дня праздника
                      </li>
                    </ul>
                  </div>
                  <div class="tickets-item__bottom">
                    <p class="tickets-item__price">
                      <span>{{ price }} ₽</span>
                    </p>
                    <button
                      v-if="days_qty === 1"
                      class="btn btn--red btn-ticket"
                      id="homeTicketOne"
                    >
                      Купить билет на 1 день
                    </button>
                    <button v-else
                    class="btn btn--red btn-ticket"
                    id="homeTicketTwo"
                    >
                      Купить билет на 2 дня
                    </button>
                  </div>
                </div>
              </swiper-slide>
            </swiper>
          </client-only>
          <div
            class="tickets-pagination swiper-pagination"
            slot="pagination"
          ></div>
        </div>
      </div>
      <Subscribe />
    </section>
    <section class="how-it-was">
      <div class="container">
        <h3 class="section-header">КАК ЭТО БЫЛО В 2019</h3>
        <p class="section-subheader">
          Два дня в Сколково, 170 топовых стримеров, 7000 посетителей и больше 2
          млн зрителей онлайн — это было легендарно!
        </p>
        <div style="padding:56.25% 0 0 0;position:relative;">
          <iframe
            src="https://player.vimeo.com/video/348364566?title=0&byline=0&portrait=0"
            loading="lazy"
            style="position:absolute;top:0;left:0;width:100%;height:100%;"
            frameborder="0"
            allow="autoplay; fullscreen; picture-in-picture"
            allowfullscreen
          ></iframe>
        </div>
      </div>
      <div class="separator gamepad">
        <svg
          width="32"
          height="23"
          viewBox="0 0 32 23"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M16.7482 4.4195H10.5012M10.5012 4.4195C10.5012 4.4195 9.40424 2.34446 8.1259 2.05068M10.5012 4.4195C10.5012 4.4195 9.42128 2.34837 8.1259 2.05068M8.1259 2.05068C6.7007 1.72315 5.27565 2.99909 4.32542 4.4195M8.1259 2.05068C6.68471 1.71947 5.26149 3.02024 4.32542 4.4195M4.32542 4.4195C1.15359 9.16076 1.00003 17.1343 1 18.6324M4.32542 4.4195C1.15105 9.16461 1.00002 17.142 1 18.6324M1 18.6324C0.999975 20.0546 1.9502 21.0021 3.3753 21.0012M1 18.6324C1 20.0593 1.94847 21.0051 3.3753 21.0012M3.3753 21.0012C7.46376 20.9987 10.5012 17.2111 10.5012 17.2111M3.3753 21.0012C7.45921 20.9887 10.5012 17.2111 10.5012 17.2111M10.5012 17.2111H16.7482"
            stroke="url(#paint2_linear-game)"
            stroke-width="2"
          />
          <path
            d="M16.7482 4.4195H21.4988M21.4988 4.4195C21.4988 4.4195 22.5958 2.34446 23.8741 2.05068M21.4988 4.4195C21.4988 4.4195 22.5787 2.34837 23.8741 2.05068M23.8741 2.05068C25.2993 1.72315 26.7244 2.99909 27.6746 4.4195M23.8741 2.05068C25.3153 1.71947 26.7385 3.02024 27.6746 4.4195M27.6746 4.4195C30.8464 9.16076 31 17.1343 31 18.6324M27.6746 4.4195C30.8489 9.16461 31 17.142 31 18.6324M31 18.6324C31 20.0546 30.0498 21.0021 28.6247 21.0012M31 18.6324C31 20.0593 30.0515 21.0051 28.6247 21.0012M28.6247 21.0012C24.5362 20.9987 21.4988 17.2111 21.4988 17.2111M28.6247 21.0012C24.5408 20.9887 21.4988 17.2111 21.4988 17.2111M21.4988 17.2111H16.7482"
            stroke="url(#paint5_linear-game)"
            stroke-width="2"
          />
          <defs>
            <linearGradient
              id="paint2_linear-game"
              x1="1"
              y1="11.6462"
              x2="16.7482"
              y2="11.6462"
              gradientUnits="userSpaceOnUse"
            >
              <stop stop-color="#35A3FF" />
              <stop offset="0.680951" stop-color="#0D6DD8" />
              <stop offset="1" stop-color="#33A0FD" />
            </linearGradient>
            <linearGradient
              id="paint5_linear-game"
              x1="31"
              y1="11.6462"
              x2="16.7482"
              y2="11.6462"
              gradientUnits="userSpaceOnUse"
            >
              <stop stop-color="#35A3FF" />
              <stop offset="0.680951" stop-color="#0D6DD8" />
              <stop offset="1" stop-color="#33A0FD" />
            </linearGradient>
          </defs>
        </svg>
      </div>
      <div class="container">
        <div class="how-it-was-photos">
          <client-only>
            <silent-box :gallery="silentbox"></silent-box>
          </client-only>
        </div>
        <div class="streamers-btn">
          <svg
            class="btn--icon"
            width="45"
            height="45"
            viewBox="0 0 45 45"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M14.3228 4.00543C15.3309 4.00543 16.1481 3.18825 16.1481 2.18021C16.1481 1.17216 15.3309 0.35498 14.3228 0.35498C13.3148 0.35498 12.4976 1.17216 12.4976 2.18021C12.4976 3.18825 13.3148 4.00543 14.3228 4.00543Z"
              fill="#A274BF"
            />
            <path
              d="M1.82522 36.1377C2.83327 36.1377 3.65045 35.3206 3.65045 34.3125C3.65045 33.3045 2.83327 32.4873 1.82522 32.4873C0.817181 32.4873 0 33.3045 0 34.3125C0 35.3206 0.817181 36.1377 1.82522 36.1377Z"
              fill="#7ACAA6"
            />
            <path
              d="M43.1747 36.1377C44.1828 36.1377 44.9999 35.3206 44.9999 34.3125C44.9999 33.3045 44.1828 32.4873 43.1747 32.4873C42.1667 32.4873 41.3495 33.3045 41.3495 34.3125C41.3495 35.3206 42.1667 36.1377 43.1747 36.1377Z"
              fill="#A274BF"
            />
            <path
              d="M43.0722 4.51813C44.0802 4.51813 44.8974 3.70094 44.8974 2.6929C44.8974 1.68486 44.0802 0.867676 43.0722 0.867676C42.0641 0.867676 41.2469 1.68486 41.2469 2.6929C41.2469 3.70094 42.0641 4.51813 43.0722 4.51813Z"
              fill="#26A6FE"
            />
            <path
              d="M44.8977 2.69315C44.8977 3.701 44.0799 4.51882 43.0721 4.51882C42.3456 4.51882 41.7187 4.09448 41.4255 3.48022C41.6074 3.54174 41.8028 3.57522 42.0063 3.57522C43.015 3.57522 43.832 2.75828 43.832 1.75044C43.832 1.4691 43.7677 1.20218 43.6537 0.963379C44.3766 1.20578 44.8977 1.88887 44.8977 2.69315Z"
              fill="#0593FC"
            />
            <path
              d="M45 34.3118C45 35.3196 44.1822 36.1375 43.1743 36.1375C42.4478 36.1375 41.8209 35.7131 41.5278 35.0989C41.7096 35.1604 41.905 35.1939 42.1086 35.1939C43.1173 35.1939 43.9342 34.3769 43.9342 33.3691C43.9342 33.0878 43.87 32.8208 43.756 32.582C44.4789 32.8245 45 33.5075 45 34.3118Z"
              fill="#925CB4"
            />
            <path
              d="M16.148 2.17948C16.148 3.18732 15.3302 4.00515 14.3224 4.00515C13.5959 4.00515 12.969 3.58081 12.6758 2.96654C12.8577 3.02807 13.0531 3.06155 13.2566 3.06155C14.2653 3.06155 15.0823 2.24461 15.0823 1.23677C15.0823 0.95543 15.018 0.688506 14.904 0.449707C15.6269 0.692109 16.148 1.3752 16.148 2.17948Z"
              fill="#925CB4"
            />
            <path
              d="M3.65037 34.3118C3.65037 35.3196 2.83255 36.1375 1.8247 36.1375C1.0982 36.1375 0.471277 35.7131 0.178162 35.0989C0.360007 35.1604 0.555388 35.1939 0.758943 35.1939C1.76766 35.1939 2.58461 34.3769 2.58461 33.3691C2.58461 33.0878 2.52036 32.8208 2.40636 32.582C3.12927 32.8245 3.65037 33.5075 3.65037 34.3118Z"
              fill="#57BE92"
            />
            <path
              d="M31.3177 32.5025C34.2265 33.1448 38.5894 34.8868 41.3375 39.6079C42.2073 41.1022 41.5703 43.0215 39.9809 43.7023C38.4693 44.35 36.7161 43.6052 36.1484 42.0619C35.3233 39.8187 33.7035 36.6545 30.608 33.8952C29.9844 33.3394 30.5021 32.3224 31.3177 32.5025Z"
              fill="#26A6FE"
            />
            <path
              d="M39.9807 43.7029C39.8721 43.7499 39.7617 43.7888 39.6513 43.8213C40.2014 42.9492 40.2702 41.8029 39.7074 40.8349C37.2656 36.6407 33.5491 34.7969 30.7101 33.9872C30.6767 33.9573 30.6423 33.9265 30.6079 33.8958C29.9846 33.3394 30.5021 32.3225 31.3181 32.5025C34.2267 33.1448 38.5892 34.8873 41.3377 39.608C42.2072 41.1027 41.5702 43.0216 39.9807 43.7029Z"
              fill="#0593FC"
            />
            <path
              d="M16.6242 14.5109C15.9006 11.7165 13.6513 5.5491 7.73426 4.49108C6.22474 4.22116 4.76435 5.17109 4.38633 6.65714C3.99961 8.1773 4.87799 9.72936 6.37837 10.1866C8.46384 10.8221 11.6755 12.1795 15.8024 15.0781C16.2068 15.3623 16.7481 14.9894 16.6242 14.5109Z"
              fill="#FE7701"
            />
            <path
              d="M32.8399 26.164C34.5901 25.4042 38.718 24.0669 41.6763 26.719C42.431 27.3956 42.5303 28.5428 41.9098 29.3443C41.2753 30.1641 40.1094 30.338 39.2607 29.7424C38.0812 28.9144 36.0675 27.7936 32.8786 26.8229C32.5662 26.7278 32.5403 26.2941 32.8399 26.164Z"
              fill="#FE7701"
            />
            <path
              d="M41.9095 29.3442C41.7521 29.5477 41.5621 29.7106 41.3522 29.8328C41.3802 29.271 41.1631 28.7037 40.7152 28.302C38.5529 26.3641 35.7665 26.5568 33.7391 27.0978C33.4622 27.0046 33.1754 26.9132 32.8787 26.8228C32.5657 26.7278 32.5403 26.2944 32.8398 26.1641C34.5904 25.4041 38.7177 24.0671 41.6761 26.7187C42.4306 27.3955 42.5301 28.5426 41.9095 29.3442Z"
              fill="#F46700"
            />
            <path
              d="M12.0575 26.164C10.3074 25.4042 6.1794 24.0669 3.22109 26.719C2.46637 27.3956 2.36714 28.5428 2.98756 29.3443C3.62213 30.1641 4.788 30.338 5.63668 29.7424C6.81617 28.9144 8.82992 27.7936 12.0189 26.8229C12.3312 26.7278 12.3571 26.2941 12.0575 26.164Z"
              fill="#26A6FE"
            />
            <path
              d="M22.4487 1.85254C20.7424 1.85254 19.6943 3.5084 19.825 5.26727C19.9787 7.33647 21.1743 9.23755 22.1082 11.0623C22.2574 11.3539 22.6398 11.3539 22.7891 11.0623C23.7229 9.23755 24.9186 7.33647 25.0723 5.26727C25.2031 3.5084 24.1551 1.85254 22.4487 1.85254Z"
              fill="#26A6FE"
            />
            <path
              d="M25.0721 5.2674C24.9183 7.33644 23.7231 9.23813 22.7895 11.0629C22.6402 11.3542 22.2574 11.3542 22.1082 11.0629C21.8983 10.6531 21.6748 10.2387 21.4541 9.81988C22.2177 8.37504 22.9622 6.87141 23.0817 5.2674C23.1848 3.88321 22.557 2.56231 21.4532 2.06291C21.7518 1.92809 22.0856 1.85303 22.4484 1.85303C24.1547 1.85303 25.2033 3.50871 25.0721 5.2674Z"
              fill="#0593FC"
            />
            <path
              d="M26.0584 34.9493C27.3855 36.3201 30.0898 39.7136 28.6483 43.4159C28.2806 44.3604 27.2416 44.857 26.2731 44.5583C25.2824 44.2528 24.7093 43.2226 24.9683 42.2187C25.3282 40.8234 25.6689 38.544 25.4553 35.2175C25.4344 34.8915 25.8312 34.7146 26.0584 34.9493Z"
              fill="#7ACAA6"
            />
            <path
              d="M28.6484 43.4157C28.2802 44.3602 27.2416 44.8569 26.2736 44.5583C26.1451 44.5185 26.023 44.4669 25.909 44.4037C26.2935 44.1938 26.6065 43.8527 26.7767 43.4157C27.8117 40.7577 26.7088 38.258 25.5137 36.5527C25.5046 36.1274 25.4857 35.6832 25.4558 35.2173C25.4341 34.8916 25.8312 34.7143 26.0583 34.9495C27.3854 36.3201 30.0895 39.7136 28.6484 43.4157Z"
              fill="#57BE92"
            />
            <path
              d="M13.5797 32.5025C10.671 33.1448 6.30802 34.8868 3.55995 39.6079C2.69018 41.1022 3.32721 43.0215 4.91654 43.7023C6.42817 44.35 8.18132 43.6052 8.7491 42.0619C9.57421 39.8187 11.1939 36.6545 14.2895 33.8952C14.913 33.3394 14.3954 32.3224 13.5797 32.5025Z"
              fill="#A274BF"
            />
            <path
              d="M31.8425 18.2612C33.674 16.9656 38.1036 14.4333 42.1466 16.7741C43.178 17.3712 43.5683 18.6678 43.047 19.7396C42.5139 20.836 41.2138 21.3165 40.0938 20.8352C38.5369 20.166 35.9495 19.3604 32.0456 19.0104C31.6631 18.976 31.5289 18.483 31.8425 18.2612Z"
              fill="#A274BF"
            />
            <path
              d="M43.0467 19.7396C42.9399 19.9594 42.8025 20.154 42.6415 20.3214C42.6786 19.499 42.2669 18.6883 41.5133 18.2523C38.1297 16.2937 34.4747 17.7484 32.2998 19.0339C32.2157 19.0249 32.1315 19.0167 32.0456 19.0095C31.663 18.976 31.529 18.4829 31.843 18.2604C33.6741 16.9649 38.1035 14.4326 42.1466 16.774C43.178 17.3711 43.5687 18.6676 43.0467 19.7396Z"
              fill="#925CB4"
            />
            <path
              d="M18.839 34.9493C17.5119 36.3201 14.8076 39.7136 16.2491 43.4159C16.6168 44.3604 17.6558 44.857 18.6244 44.5583C19.6151 44.2528 20.1881 43.2226 19.9292 42.2187C19.5693 40.8234 19.2286 38.544 19.4422 35.2175C19.463 34.8915 19.0662 34.7146 18.839 34.9493Z"
              fill="#FE7701"
            />
            <path
              d="M13.0549 18.2612C11.2234 16.9656 6.79385 14.4333 2.75079 16.7741C1.71939 17.3712 1.32907 18.6678 1.85035 19.7396C2.38349 20.836 3.68357 21.3165 4.80365 20.8352C6.36046 20.166 8.94787 19.3604 12.8518 19.0104C13.2343 18.976 13.3685 18.483 13.0549 18.2612Z"
              fill="#7ACAA6"
            />
            <path
              d="M28.2731 14.5113C28.9968 11.7169 31.2461 5.5495 37.1631 4.49157C38.6726 4.22165 40.133 5.17157 40.511 6.65763C40.8978 8.17779 40.0194 9.72985 38.519 10.1871C36.4335 10.8226 33.2218 12.18 29.0949 15.0786C28.6905 15.3627 28.1492 14.9897 28.2731 14.5113Z"
              fill="#7ACAA6"
            />
            <path
              d="M40.5452 6.81339C39.9065 6.29141 39.0542 6.04347 38.1866 6.19816C33.2443 7.0811 30.8612 11.5296 29.7882 14.6001C29.5603 14.7548 29.3295 14.9141 29.0952 15.0787C28.6908 15.3628 28.1489 14.9891 28.2728 14.5115C28.9966 11.7168 31.2457 5.54952 37.1633 4.49097C38.6724 4.22141 40.1325 5.17133 40.5107 6.65774C40.5244 6.70933 40.5352 6.7618 40.5452 6.81339Z"
              fill="#57BE92"
            />
            <path
              d="M23.4546 16.1366L25.0966 19.4636C25.26 19.7947 25.5759 20.0242 25.9412 20.0773L29.6129 20.6108C30.533 20.7444 30.9004 21.8752 30.2346 22.5241L27.5779 25.1138C27.3135 25.3715 27.1928 25.7429 27.2552 26.1067L27.8824 29.7635C28.0395 30.6799 27.0778 31.3787 26.2548 30.9461L22.9708 29.2196C22.644 29.0477 22.2536 29.0477 21.9268 29.2196L18.6428 30.9461C17.8198 31.3788 16.858 30.68 17.0152 29.7635L17.6423 26.1067C17.7047 25.7429 17.5841 25.3715 17.3197 25.1138L14.6629 22.5241C13.9972 21.8752 14.3646 20.7444 15.2847 20.6108L18.9563 20.0773C19.3217 20.0242 19.6376 19.7947 19.8009 19.4636L21.4429 16.1366C21.8542 15.3028 23.0431 15.3028 23.4546 16.1366Z"
              fill="#FDB441"
            />
            <path
              d="M27.5781 25.1135C27.313 25.3713 27.1927 25.7431 27.2551 26.1068L27.882 29.7636C28.0394 30.68 27.0777 31.3785 26.2545 30.9461L25.5216 30.5607C25.8537 30.3101 26.0572 29.8894 25.9757 29.4126L25.3108 25.5342C25.2438 25.1479 25.3723 24.7543 25.6528 24.4811L28.47 21.7344C28.8318 21.3825 28.906 20.8967 28.7614 20.4868L29.6127 20.6107C30.5328 20.7446 30.9001 21.8755 30.2342 22.5242L27.5781 25.1135Z"
              fill="#FEA613"
            />
          </svg>

          <a
            href="https://vk.com/streamfest"
            class="btn btn-w-icon btn--blue"
            target="_blank"
            rel="noopener noreferrer"
          >
              Больше фото
          </a>
        </div>
      </div>
      <div class="side-parts">
        <img src="/side-parts_3.svg" loading="lazy" />
        <img src="/side-parts_4.svg" loading="lazy" />
      </div>
    </section>
    <section class="feedbacks">
      <div class="container">
        <div class="feedbacks__slider-wrap">
          <client-only>
            <swiper :options="feedbacksOptions">
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Стримфест&nbsp;&mdash; это прекрасная возможность
                      познакомиться с&nbsp;культурой стриминга, популярными
                      кастерами и&nbsp;научиться новому. Я&nbsp;рад, что
                      мы&nbsp;можем делиться опытом и&nbsp;развиваться.
                    </p>
                    <p class="feedback-item__from">
                      Денис WELOVEGAMES Коробков
                    </p>
                    <p class="feedback-item__who">Стример</p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/1_s.jpg" loading="lazy" />
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Это невероятно круто&nbsp;&mdash; вживую видеть свое
                      комьюнити, такие встречи всегда делают вас ближе.
                      Стримфест&nbsp;&mdash; отличный повод встретиться
                      со&nbsp;своей аудиторией из&nbsp;разных уголков планеты.
                    </p>
                    <p class="feedback-item__from">Вика Картер</p>
                    <p class="feedback-item__who">Видеоблогер</p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/2_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Подкастинг в&nbsp;плане фидбека&nbsp;&mdash; как подводная
                      лодка. Идешь по приборам, вслепую. Поэтому встретиться
                      с&nbsp;подписчиками, записать подкаст у&nbsp;них
                      на&nbsp;глазах&nbsp;&mdash; это потрясающе.
                    </p>
                    <p class="feedback-item__from">Павел Пивоваров</p>
                    <p class="feedback-item__who">
                      Подкастер
                    </p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/3_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Я&nbsp;вообще боюсь большого скопления людей,
                      но&nbsp;в&nbsp;этот раз я&nbsp;не&nbsp;чувствовала
                      дискомфорта. Мы&nbsp;были на&nbsp;таком мероприятии
                      впервые, но&nbsp;нам безумно понравилось.
                    </p>
                    <p class="feedback-item__from">Людмила Морозова</p>
                    <p class="feedback-item__who">
                      Посетитель
                    </p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/4_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Невероятно эмоциональное событие, которое
                      с&nbsp;нетерпением ждешь каждый год. Беспрерывный поток
                      совместного творчества, который дает тебе уникальный буст.
                      Это нужно пережить.
                    </p>
                    <p class="feedback-item__from">Дмитрий dayzru Нардов</p>
                    <p class="feedback-item__who">
                      Стример
                    </p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/5_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Лекторий, несомненно, интересная задумка. У&nbsp;стримеров
                      есть возможность доносить свои знания не&nbsp;только
                      с&nbsp;виртуальной трибуны,
                      но&nbsp;и&nbsp;с&nbsp;реальной. Я&nbsp;остался доволен,
                      что тут говорить!
                    </p>
                    <p class="feedback-item__from">Евгений Мелёхин</p>
                    <p class="feedback-item__who">
                      Посетитель
                    </p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/6_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Фестиваль очень помог и&nbsp;в&nbsp;развитии канала,
                      и&nbsp;новые знакомства приобрести. К&nbsp;тому&nbsp;же
                      еще и&nbsp;партнерку одобрили, и&nbsp;все благодаря
                      ВАААМ!<br /><br />
                    </p>
                    <p class="feedback-item__from">Лилия Lily_Mint Аюпова</p>
                    <p class="feedback-item__who">
                      Стример
                    </p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/7_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="feedback-item">
                  <div class="feedback-item__inner">
                    <p class="feedback-item__text">
                      Приходя на&nbsp;Стримфест, понимаешь, что хейтеров
                      на&nbsp;самом деле не&nbsp;существует. В&nbsp;жизни все
                      зрители доброжелательные. Просят тебя расписаться,
                      сфоткаться с&nbsp;ними.
                    </p>
                    <p class="feedback-item__from">
                      Алексей Stery_RJV Рыженков
                    </p>
                    <p class="feedback-item__who">
                      Стример
                    </p>
                  </div>
                  <div class="feedback-item__image">
                    <img src="/reviews/8_s.jpg" loading="lazy"/>
                  </div>
                </div>
              </swiper-slide>
            </swiper>
          </client-only>
          <div
            class="feedbacks-button-next swiper-button-next"
            slot="button-next"
          ></div>
          <div
            class="feedbacks-button-prev swiper-button-prev"
            slot="button-prev"
          ></div>
          <div
            class="feedbacks-pagination swiper-pagination"
            slot="pagination"
          ></div>
        </div>
      </div>
      <div class="separator crown desktop-hidden">
        <svg
          width="30"
          height="24"
          viewBox="0 0 30 24"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M3.08911 20.9933L3.08902 20.9928L1.0107 8.69856C1.01069 8.69851 1.01068 8.69846 1.01067 8.69841C1.01066 8.69833 1.01065 8.69824 1.01063 8.69816C0.963834 8.41976 1.07429 8.14931 1.27507 7.99322L1.27507 7.99323L1.27803 7.9909C1.46862 7.84158 1.72366 7.81408 1.94684 7.92287C1.94725 7.92307 1.94765 7.92327 1.94806 7.92346L8.07497 10.9527L8.93456 11.3777L9.39522 10.5367L14.4253 1.35339L14.4256 1.35287C14.683 0.882376 15.317 0.882375 15.5744 1.35287L15.5747 1.35339L20.6048 10.5367L21.0654 11.3777L21.925 10.9527L28.053 7.92295C28.0532 7.92284 28.0534 7.92273 28.0537 7.92262C28.2744 7.81446 28.5309 7.84123 28.722 7.99091L28.7249 7.99322C28.9258 8.14938 29.0363 8.42002 28.9893 8.69856L26.911 20.9911L26.9109 20.9918C26.7119 22.1737 25.7259 23 24.6136 23H5.38642C4.27379 23 3.28792 22.1734 3.08911 20.9933Z"
            stroke="#C4C4C4"
            stroke-width="2"
          />
          <path
            d="M3.08911 20.9933L3.08902 20.9928L1.0107 8.69856C1.01069 8.69851 1.01068 8.69846 1.01067 8.69841C1.01066 8.69833 1.01065 8.69824 1.01063 8.69816C0.963834 8.41976 1.07429 8.14931 1.27507 7.99322L1.27507 7.99323L1.27803 7.9909C1.46862 7.84158 1.72366 7.81408 1.94684 7.92287C1.94725 7.92307 1.94765 7.92327 1.94806 7.92346L8.07497 10.9527L8.93456 11.3777L9.39522 10.5367L14.4253 1.35339L14.4256 1.35287C14.683 0.882376 15.317 0.882375 15.5744 1.35287L15.5747 1.35339L20.6048 10.5367L21.0654 11.3777L21.925 10.9527L28.053 7.92295C28.0532 7.92284 28.0534 7.92273 28.0537 7.92262C28.2744 7.81446 28.5309 7.84123 28.722 7.99091L28.7249 7.99322C28.9258 8.14938 29.0363 8.42002 28.9893 8.69856L26.911 20.9911L26.9109 20.9918C26.7119 22.1737 25.7259 23 24.6136 23H5.38642C4.27379 23 3.28792 22.1734 3.08911 20.9933Z"
            stroke="#BAC8CF"
            stroke-width="2"
          />
        </svg>
      </div>
    </section>
    <section class="awards">
      <div class="container">
        <h3 class="section-header">STREAMFEST AWARDS</h3>
        <p class="section-subheader">
          Яркое эфирное шоу, где популярные стримеры, эксперты&nbsp;рынка
          и&nbsp;журналисты&nbsp;развлекательных медиа&nbsp;выбрали лучших из
          лучших в 13&nbsp;номинациях.
          <a
            class=" btn btn--awards"
            href="https://streamscharts.com/streamfestawards2020"
            target="_blank"
            rel="noopener noreferrer"
          >
            <div class="letters">
              Как&nbsp;это&nbsp;было
            </div></a
          >
        </p>
        <div class="awards-img">
          <img src="/awards.png" loading="lazy"/>
        </div>
      </div>
    </section>
    <div class="separator crown mobile-hidden">
      <svg
        width="30"
        height="24"
        viewBox="0 0 30 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M3.08911 20.9933L3.08902 20.9928L1.0107 8.69856C1.01069 8.69851 1.01068 8.69846 1.01067 8.69841C1.01066 8.69833 1.01065 8.69824 1.01063 8.69816C0.963834 8.41976 1.07429 8.14931 1.27507 7.99322L1.27507 7.99323L1.27803 7.9909C1.46862 7.84158 1.72366 7.81408 1.94684 7.92287C1.94725 7.92307 1.94765 7.92327 1.94806 7.92346L8.07497 10.9527L8.93456 11.3777L9.39522 10.5367L14.4253 1.35339L14.4256 1.35287C14.683 0.882376 15.317 0.882375 15.5744 1.35287L15.5747 1.35339L20.6048 10.5367L21.0654 11.3777L21.925 10.9527L28.053 7.92295C28.0532 7.92284 28.0534 7.92273 28.0537 7.92262C28.2744 7.81446 28.5309 7.84123 28.722 7.99091L28.7249 7.99322C28.9258 8.14938 29.0363 8.42002 28.9893 8.69856L26.911 20.9911L26.9109 20.9918C26.7119 22.1737 25.7259 23 24.6136 23H5.38642C4.27379 23 3.28792 22.1734 3.08911 20.9933Z"
          stroke="url(#paint0_linear23)"
          stroke-width="2"
        />
        <defs>
          <linearGradient
            id="paint0_linear23"
            x1="0"
            y1="12.1846"
            x2="30"
            y2="12.1846"
            gradientUnits="userSpaceOnUse"
          >
            <stop stop-color="#35A3FF" />
            <stop offset="0.680951" stop-color="#0D6DD8" />
            <stop offset="1" stop-color="#33A0FD" />
          </linearGradient>
        </defs>
      </svg>
    </div>
    <section class="partners">
      <div class="container">
        <h3 class="section-header">СТРАТЕГИЧЕСКИЕ ПАРТНЕРЫ</h3>
        <div class="partners-img strategy">
          <a
            href="https://www.mvideo.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/mvideo.png" loading="lazy"/>
          </a>
          <a
            href="https://www.lg.com/ru/ergo-monitors"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/lg.png" loading="lazy"/>
          </a>
          <a
            href="https://www.bigo.tv/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/bigo-live.png" loading="lazy"/>
          </a>
        </div>
        <h3 class="section-header">ОФИЦИАЛЬНЫЕ ПАРТНЕРЫ</h3>
        <div class="partners-img official">
          <a
            href="https://www.logitech.com/ru-ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/logitech.png" loading="lazy"/>
          </a>
          <a
            href="https://zen.yandex.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/yandex_dzen.png" loading="lazy"/>
          </a>
          <a
            href="https://www.amd.com/ru"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/amd.png" loading="lazy"/>
          </a>
           <a
            href="https://www.faceit.com/en"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/faceit.png" loading="lazy"/>
          </a>
          <a
            href="https://goodgame.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/goodgame.png" loading="lazy"/>
          </a>
        </div>
        <h3 class="section-header">ПАРТНЕРЫ ТЕМАТИЧЕСКИХ&nbsp;ЗОН</h3>
        <div class="partners-img tematic">
            <a
            href="https://wasd.tv"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/wasd.png" loading="lazy"/>
          </a>
           <a
            href="https://fantv.ru"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/fan.png" loading="lazy"/>
          </a>
          <a
            href="https://reyden-x.com"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/reyden-x.png" loading="lazy"/>
          </a>
          <a
            href="https://schoolskills.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/school_skills.png" loading="lazy"/>
          </a>
           <a
            href="https://synergy.ru"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/synergy.png" loading="lazy"/>
          </a>
          <a
            href="https://podari-zhizn.ru/main"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/podari_jizn.png" loading="lazy"/>
          </a>
        </div>
        <h3 class="section-header">ТЕХНИЧЕСКАЯ ПОДДЕРЖКА</h3>
        <div class="partners-img tematic">
          <a
            href="https://www.bluemics.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/blue.png" loading="lazy"/>
          </a>
          <a href="https://warp.wtf/" target="_blank" rel="noopener noreferrer">
            <img src="/partners/warp.png" loading="lazy"/>
          </a>
          <a
            href="https://hyperpc.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/hyper.png" loading="lazy"/>
          </a>
          <a href="http://red-square.org/" target="_blank" rel="noopener noreferrer">
            <img src="/partners/red-square.png" loading="lazy"/>
          </a>
          <a href="https://flick.redbull.com/" target="_blank" rel="noopener noreferrer">
            <img src="/partners/redbull.png" loading="lazy"/>
          </a>
          <a
            href="https://streamscharts.com/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/stream-charts.png" loading="lazy"/>
          </a>
          <a
            href="https://www.dell.com/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/dell.png" loading="lazy"/>
          </a>
          <a
            href="https://www.dmitrylive.com/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/dmitry_live.png" loading="lazy"/>
          </a>
          <a
            href="https://en-us.sennheiser.com/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/sennheiser.png" loading="lazy"/>
          </a>
        </div>
        <h3 class="section-header">ИНФОРМАЦИОННАЯ ПОДДЕРЖКА</h3>
        <div class="partners-img tematic information">
          <a
            href="https://www.igromania.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/mania.png" loading="lazy"/>
          </a>
          <a
            href="https://tv.m24.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/moskva24.svg" loading="lazy"/>
          </a>
          <a
            href="https://daily.afisha.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/afisha.png" loading="lazy"/>
          </a>
          <a
            href="https://www.cybersport.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/cybersport.png" loading="lazy"/>
          </a>
          <a
            href="https://www.mirf.ru/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <img src="/partners/mirf.png" loading="lazy"/>
          </a>
        </div>
        <div class="partners-btn">
          <button @click="openPartnersModal" class="btn btn--red btn--big">
            Хочу стать партнером
          </button>
        </div>
      </div>
      <div class="side-parts">
        <img src="/side-parts_5.png" loading="lazy"/>
        <img src="/side-parts_6.png" loading="lazy"/>
      </div>
    </section>
    <div v-if="partnersIframe" class="partners-modal">
      <button @click="closePartnersModal" class="partners-modal__close">
        ✖
      </button>
      <iframe
        class="partners-modal__iframe"
        src="https://docs.google.com/forms/d/e/1FAIpQLSeMR_dy_vI2fTg89_Qf8ssprOwOFiwIaPRdzIrm9-MPr8yUdA/viewform?embedded=true"
        loading="lazy"
        frameborder="0"
        marginheight="0"
        marginwidth="0"
        >Loading…</iframe
      >
    </div>
  </div>
</template>

<script>
import StreamerCard from "@/components/StreamerCard";
import StreamersSwiper from "@/components/StreamersSwiper";
import Subscribe from "@/components/Subscribe";
export default {
  components: {
    StreamerCard,
    StreamersSwiper,
    Subscribe
  },
  data() {
    return {
      mainVideoSrc: '',
      streamers: [],
      tickets: [],
      ticketsOptions: {
        spaceBetween: 0,
        slidesPerView: 1.1,
        loop: true,
        autoplay: {
          delay: 8000,
          disableOnInteraction: false
        },
        pagination: {
          el: ".tickets-pagination",
          clickable: true
        },
        breakpoints: {
          0: {
            slidesPerView: 1
          },
          375: {
            slidesPerView: 1.1
          },
          510: {
            slidesPerView: 1.4
          }
        }
      },
      silentbox: [
        {
          src: "/home_gall/1.jpg",
          thumbnail: "/home_gall/1_s.png"
        },
        {
          src: "/home_gall/2.jpg",
          thumbnail: "/home_gall/2_s.png"
        },
        {
          src: "/home_gall/4.jpg",
          thumbnail: "/home_gall/4_s.png"
        },
        {
          src: "/home_gall/3.jpg",
          thumbnail: "/home_gall/3_s.png"
        },
        {
          src: "/home_gall/5.jpg",
          thumbnail: "/home_gall/5_s.png"
        },
        {
          src: "/home_gall/6.jpg",
          thumbnail: "/home_gall/6_s.png"
        }
      ],
      feedbacksOptions: {
        autoHeight: true,
        loop: true,
        autoplay: {
          delay: 8000,
          disableOnInteraction: false
        },

        navigation: {
          nextEl: ".feedbacks-button-next",
          prevEl: ".feedbacks-button-prev"
        },
        breakpoints: {
          0: {
            slidesPerView: 1,
            spaceBetween: 20
          },
          350: {
            slidesPerView: 1.1
          },
          410: {
            slidesPerView: 1.2
          },
          560: {
            slidesPerView: 1.7
          },
          650: {
            slidesPerView: 2
          },
          700: {
            slidesPerView: 2.1
          },
          768: {
            slidesPerView: 2.3,
            spaceBetween: 20
          },

          1024: {
            slidesPerView: 3,
            spaceBetween: 20,
            pagination: {
              el: ".feedbacks-pagination",
              clickable: true
            }
          }
        }
      },
      partnersIframe: false
    };
  },
  computed: {
    lastDay() {
      let days = Math.floor(
        (new Date("Aug 7, 2021 11:00:00").getTime() - new Date().getTime()) /
          86400000
      ).toString();
      const lastNum = days.substr(-1);
      if (lastNum === "1") days += " день";
      else if (["2", "3", "4"].includes(lastNum)) days += " дня";
      else days += " дней";
      return days;
    }
  },
  async mounted() {
    this.$router.currentRoute.hash === "#tickets" && this.handleScroll();
    this.mainVideoSrc = '/videos/home.mp4'
    const script = document.createElement("script");
    script.src = "https://player.vimeo.com/api/player.js";
    document.body.appendChild(script);
    this.streamers = (await this.$axios.get("/api/get_streamers?at_home=show"))
      .data
    this.tickets = (await this.$axios.get("/api/get_ticket_types")).data;
  },
  methods: {
    async addItem(t_id) {
      await this.$store.dispatch("cart/addItem", {
        t_id
      });
      const { $router } = this;
      this.$notify({
        title: "Успешно",
        message: "Билет добавлен в корзину",
        type: "success",
        customClass: "c-pointer",
        onClick() {
          $router.push("cart");
        }
      });
    },
    ticketsSwiperClick(e) {
      e.target.classList.contains("btn-ticket") &&
        this.addItem(
          this.$refs.ticketsSwiper.$swiper.clickedSlide.attributes[1].value
        );
    },
    handleScroll() {
      const anchor = document.querySelector(`#tickets`);
      if (anchor) {
        window.scrollTo({
          top: anchor.getBoundingClientRect().top + window.pageYOffset
        });
      }
    },
    openPartnersModal() {
      document.querySelector("body").style.overflow = "hidden";
      this.partnersIframe = true;
    },
    closePartnersModal() {
      this.partnersIframe = false;
      document.querySelector("body").style.overflow = "visible";
    }
  }
};
</script>
