<template>
  <section class="location">
    <div class="container-1000">
      <img class="location-banner" src="/location.jpg" alt="" />
      <h1 class="section-header">Стримфест — в Технопарке Сколково</h1>
      <div class="location-subtitle">
        <p>
          <b>Москва, Большой бульвар, д. 42, стр. 1</b> Станция «Сколково»
          направления МЦД-1 Адрес для такси: парковка Технопарк Сколково
        </p>
      </div>
    </div>
    <div class="separator rocket"></div>
    <div class="container container-1000">
      <h3 class="location-title text-center">
        Как и на чем приехать на Стримфест
      </h3>
      <p class="mb-45">
        Стримфест проходит в Технопарке «Сколково» в Москве. К нам можно доехать
        на легком метро направления <br />
        МЦД-1, на такси, своей машине, каршеринге или городском автобусе.<br /><br />

        Каждый транспорт едет по-своему. Обязательно посмотрите, как проехать на
        вашем виде транспорта!
      </p>
      <div class="location-tabs">
        <div class="location-tabs__top">
          <div
            :class="{ tabItemActive: activeTab === 1 }"
            @click="activeTab = 1"
            class="location-tabs__item "
          >
            <svg width="53px" height="37px">
              <path
                d="M49.265,31.728 L37.300,0.851 L26.978,18.838 L16.655,0.851 L4.690,31.728 L0.983,31.728 L0.983,36.400 L18.888,36.400 L18.888,31.728 L16.360,31.728 L19.352,24.125 L26.978,36.824 L34.603,24.125 L37.595,31.728 L35.067,31.728 L35.067,36.400 L52.973,36.400 L52.973,31.728 L49.265,31.728 Z"
              />
            </svg>
            <p><b>Легкое метро МЦД-1</b></p>
          </div>
          <div
            :class="{ tabItemActive: activeTab === 2 }"
            @click="activeTab = 2"
            class="location-tabs__item"
          >
            <svg width="56px" height="31px">
              <path
                d="M55.834,19.860 L53.661,14.247 C53.435,13.662 52.876,13.277 52.253,13.277 L42.606,13.277 L35.758,5.419 C35.471,5.090 35.058,4.902 34.623,4.902 L31.685,4.902 L31.685,2.265 C31.685,1.424 31.009,0.742 30.174,0.742 L24.247,0.742 C23.412,0.742 22.736,1.424 22.736,2.265 L22.736,4.902 L14.057,4.902 C13.514,4.902 13.012,5.195 12.744,5.671 L8.445,13.277 L2.470,13.277 C1.635,13.277 0.959,13.959 0.959,14.800 L0.959,24.505 C0.959,25.346 1.635,26.028 2.470,26.028 L5.682,26.028 C6.359,28.715 8.770,30.711 11.642,30.711 C14.514,30.711 16.926,28.715 17.602,26.028 L36.970,26.028 C37.646,28.715 40.058,30.711 42.930,30.711 C45.801,30.711 48.213,28.715 48.890,26.028 L54.268,26.028 C55.079,26.028 55.746,25.382 55.778,24.564 L55.936,20.473 C55.944,20.264 55.909,20.055 55.834,19.860 ZM38.583,13.277 L17.162,13.277 L19.887,7.949 L24.247,7.949 L30.174,7.949 L33.939,7.949 L38.583,13.277 ZM25.758,3.789 L28.663,3.789 L28.663,4.902 L25.758,4.902 L25.758,3.789 ZM3.981,16.324 L9.323,16.324 C9.866,16.324 10.367,16.030 10.636,15.554 L14.935,7.949 L16.487,7.949 L13.339,14.102 C13.098,14.574 13.118,15.139 13.392,15.593 C13.666,16.047 14.155,16.324 14.682,16.324 L22.736,16.324 L22.736,22.982 L17.602,22.982 C16.926,20.295 14.514,18.299 11.642,18.299 C8.770,18.299 6.359,20.295 5.682,22.982 L3.981,22.982 L3.981,16.324 ZM11.642,27.664 C9.914,27.664 8.509,26.247 8.509,24.505 C8.509,22.763 9.914,21.346 11.642,21.346 C13.369,21.346 14.775,22.763 14.775,24.505 C14.775,26.247 13.369,27.664 11.642,27.664 ZM42.930,27.664 C41.202,27.664 39.797,26.247 39.797,24.505 C39.797,22.763 41.202,21.346 42.930,21.346 C44.657,21.346 46.063,22.763 46.063,24.505 C46.063,26.247 44.657,27.664 42.930,27.664 ZM52.815,22.982 L48.890,22.982 C48.213,20.295 45.801,18.299 42.930,18.299 C40.058,18.299 37.646,20.295 36.970,22.982 L25.758,22.982 L25.758,20.513 L26.090,20.513 C26.925,20.513 27.601,19.831 27.601,18.989 C27.601,18.148 26.925,17.466 26.090,17.466 L25.758,17.466 L25.758,16.324 L41.922,16.324 L51.221,16.324 L52.904,20.672 L52.815,22.982 Z"
              />
            </svg>
            <p><b>Яндекс.Такси или Uber</b></p>
          </div>
          <div
            :class="{ tabItemActive: activeTab === 3 }"
            @click="activeTab = 3"
            class="location-tabs__item"
          >
            <svg width="53px" height="34px">
              <path
                d="M51.887,8.670 C50.231,4.036 45.755,0.924 40.750,0.924 L33.856,0.924 L23.985,0.924 L2.413,0.924 C1.592,0.924 0.926,1.590 0.926,2.412 L0.926,27.761 C0.926,28.583 1.592,29.249 2.413,29.249 L6.300,29.249 C6.968,31.938 9.394,33.940 12.285,33.940 C15.176,33.940 17.602,31.938 18.270,29.249 L23.985,29.249 L33.856,29.249 L36.025,29.249 C36.693,31.938 39.119,33.940 42.010,33.940 C44.901,33.940 47.327,31.938 47.995,29.249 L51.457,29.249 C52.278,29.249 52.944,28.583 52.944,27.761 L52.944,14.699 C52.944,12.656 52.589,10.627 51.887,8.670 ZM49.087,9.672 C49.502,10.829 49.764,12.015 49.886,13.211 L41.340,13.211 L39.806,11.675 L39.806,3.899 L40.750,3.899 C44.502,3.899 47.853,6.219 49.087,9.672 ZM35.343,3.899 L36.832,3.899 L36.832,10.803 L35.343,10.803 L35.343,3.899 ZM22.498,10.803 L14.686,10.803 L14.686,3.899 L22.498,3.899 L22.498,10.803 ZM11.712,3.899 L11.712,10.803 L3.900,10.803 L3.900,3.899 L11.712,3.899 ZM3.900,20.919 L5.451,20.919 C6.273,20.919 6.938,20.253 6.938,19.431 C6.938,18.610 6.273,17.943 5.451,17.943 L3.900,17.943 L3.900,13.778 L22.498,13.778 L22.498,26.273 L18.270,26.273 C17.602,23.584 15.176,21.582 12.285,21.582 C9.394,21.582 6.967,23.584 6.299,26.273 L3.900,26.273 L3.900,20.919 ZM12.285,30.964 C10.520,30.964 9.085,29.527 9.085,27.761 C9.085,25.995 10.520,24.558 12.285,24.558 C14.049,24.558 15.485,25.995 15.485,27.761 C15.485,29.527 14.049,30.964 12.285,30.964 ZM25.471,26.273 L25.471,3.899 L32.369,3.899 L32.369,26.273 L25.471,26.273 ZM42.010,30.964 C40.245,30.964 38.810,29.527 38.810,27.761 C38.810,25.995 40.245,24.558 42.010,24.558 C43.774,24.558 45.210,25.995 45.210,27.761 C45.210,29.527 43.774,30.964 42.010,30.964 ZM47.995,26.273 C47.327,23.584 44.901,21.582 42.010,21.582 C39.119,21.582 36.693,23.584 36.025,26.273 L35.343,26.273 L35.343,13.778 L37.703,13.778 L39.673,15.751 C39.952,16.030 40.330,16.187 40.724,16.187 L49.970,16.187 L49.970,17.943 L48.419,17.943 C47.598,17.943 46.932,18.610 46.932,19.431 C46.932,20.253 47.598,20.919 48.419,20.919 L49.970,20.919 L49.970,26.273 L47.995,26.273 Z"
              />
            </svg>
            <p><b>Рейсовые автобусы</b></p>
          </div>
          <div
            :class="{ tabItemActive: activeTab === 4 }"
            @click="activeTab = 4"
            class="location-tabs__item"
          >
            <svg width="68px" height="24px">
              <path
                d="M67.505,16.607 C67.636,16.383 67.710,16.124 67.710,15.853 L67.710,12.892 C67.710,12.418 67.483,11.971 67.099,11.690 C60.603,6.913 54.813,5.962 47.920,5.215 C46.843,5.098 45.789,4.819 44.786,4.386 L39.949,2.295 C35.926,0.555 31.510,-0.008 27.179,0.670 L13.014,2.877 L1.732,2.123 C1.082,2.082 0.455,2.471 0.220,3.090 C-0.014,3.708 0.187,4.404 0.714,4.806 L3.307,6.776 L3.237,6.868 C2.903,7.314 2.847,7.906 3.087,8.407 L5.274,12.947 C5.460,13.333 5.804,13.622 6.220,13.740 L7.607,14.133 L8.185,17.919 C8.297,18.650 8.931,19.191 9.676,19.191 L12.163,19.191 C13.045,21.973 15.665,23.996 18.753,23.996 C21.841,23.996 24.463,21.973 25.344,19.191 L47.412,19.191 C48.293,21.973 50.914,23.996 54.002,23.996 C57.091,23.996 59.711,21.973 60.592,19.191 L66.468,19.191 C67.301,19.191 67.976,18.521 67.976,17.695 C67.976,17.267 67.794,16.880 67.505,16.607 ZM27.646,3.626 C31.416,3.042 35.251,3.528 38.746,5.039 L39.537,5.381 L25.707,5.676 L25.517,3.958 L27.646,3.626 ZM19.022,4.970 L22.535,4.423 L22.676,5.704 L18.685,5.704 L19.022,4.970 ZM18.753,21.003 C16.607,21.003 14.861,19.268 14.861,17.137 C14.861,15.007 16.607,13.273 18.753,13.273 C20.900,13.273 22.646,15.007 22.646,17.137 C22.646,19.268 20.900,21.003 18.753,21.003 ZM47.167,16.198 L25.589,16.198 C25.498,15.547 25.319,14.925 25.057,14.346 L26.251,14.346 L27.161,15.083 C27.430,15.301 27.766,15.420 28.114,15.420 L47.323,15.420 C47.256,15.674 47.204,15.933 47.167,16.198 ZM54.002,21.003 C51.856,21.003 50.109,19.268 50.109,17.137 C50.109,15.007 51.856,13.273 54.002,13.273 C56.149,13.273 57.895,15.007 57.895,17.137 C57.895,19.268 56.149,21.003 54.002,21.003 ZM64.695,14.921 L62.076,16.198 L60.837,16.198 C60.374,12.861 57.490,10.280 54.002,10.280 C52.009,10.280 50.216,11.127 48.954,12.472 C48.841,12.445 48.724,12.426 48.602,12.426 L28.651,12.426 L27.741,11.690 C27.472,11.471 27.135,11.353 26.788,11.353 L22.447,11.353 C21.377,10.677 20.112,10.280 18.753,10.280 C15.266,10.280 12.382,12.861 11.919,16.198 L10.973,16.198 L10.444,12.734 C10.355,12.155 9.934,11.680 9.367,11.519 L7.701,11.047 L6.199,7.930 L6.599,7.396 C6.599,7.395 6.600,7.394 6.600,7.394 C6.601,7.393 6.601,7.392 6.601,7.392 L7.013,6.842 L15.453,5.527 L14.969,6.580 C14.757,7.043 14.795,7.582 15.073,8.011 C15.351,8.438 15.828,8.697 16.341,8.697 L24.391,8.697 L47.689,8.202 C53.858,8.873 59.072,9.726 64.695,13.657 L64.695,14.921 Z"
              />
            </svg>
            <p><b>Свой автомобиль</b></p>
          </div>
          <div
            :class="{ tabItemActive: activeTab === 5 }"
            @click="activeTab = 5"
            class="location-tabs__item"
          >
            <svg width="41px" height="31px">
              <path
                d="M40.160,15.283 L33.950,12.273 L29.681,1.779 C29.453,1.217 28.902,0.849 28.289,0.849 L2.517,0.849 C1.714,0.849 1.054,1.474 1.018,2.268 L0.018,24.764 C0.000,25.168 0.150,25.562 0.433,25.855 C0.716,26.147 1.108,26.312 1.517,26.312 L4.394,26.312 C5.065,28.928 7.459,30.871 10.310,30.871 C13.161,30.871 15.555,28.928 16.227,26.312 L25.056,26.312 C25.728,28.928 28.122,30.871 30.973,30.871 C33.824,30.871 36.219,28.928 36.890,26.312 L39.500,26.312 C40.328,26.312 41.000,25.648 41.000,24.829 L41.000,16.614 C41.000,16.048 40.674,15.532 40.160,15.283 ZM30.553,11.871 L9.480,11.871 L9.480,3.815 L27.276,3.815 L30.553,11.871 ZM3.953,3.815 L6.479,3.815 L6.479,13.354 C6.479,14.173 7.151,14.838 7.980,14.838 L18.481,14.838 L18.481,23.346 L16.227,23.346 C15.555,20.730 13.161,18.787 10.310,18.787 C7.459,18.787 5.065,20.730 4.394,23.346 L3.084,23.346 L3.953,3.815 ZM10.310,27.905 C8.595,27.905 7.200,26.525 7.200,24.829 C7.200,23.133 8.595,21.754 10.310,21.754 C12.025,21.754 13.421,23.133 13.421,24.829 C13.421,26.525 12.025,27.905 10.310,27.905 ZM30.973,27.905 C29.258,27.905 27.863,26.525 27.863,24.829 C27.863,23.133 29.258,21.754 30.973,21.754 C32.688,21.754 34.084,23.133 34.084,24.829 C34.084,26.525 32.688,27.905 30.973,27.905 ZM37.999,23.346 L36.890,23.346 C36.219,20.730 33.824,18.787 30.973,18.787 C28.122,18.787 25.728,20.730 25.056,23.346 L21.481,23.346 L21.481,19.942 L22.090,19.942 C22.919,19.942 23.591,19.278 23.591,18.459 C23.591,17.640 22.919,16.975 22.090,16.975 L21.481,16.975 L21.481,14.838 L32.426,14.838 L37.999,17.539 L37.999,23.346 Z"
              />
            </svg>
            <p><b>Каршеринг</b></p>
          </div>
        </div>
        <div
          :class="{ tabContentActive: activeTab === 1 }"
          class="location-tabs__content "
        >
          <p>
            С 2020 года до Сколково ходит легкое метро. Электрички отправляются
            каждые 5-15 минут. <br />
            Вам нужна станция Сколково на направлении
            <a href="" class="link">МЦД-1</a> (Одинцово — Лобня).<br /><br />

            Дорога от центра Москвы до Стримфеста занимает 40-50 минут. <br />
            Вся поездка на метро и МЦД-1 по карте Тройка стоит 50 рублей.<br /><br />

            Линии МЦД-1 есть на схеме движения в каждом вагоне метро.<br />
            <a href="" class="link">Интерактивная карта</a>. <br /><br />
            <b>Самая удобная пересадка на МЦД-1</b> — из метро
            <img src="/m-d-b.png" alt="" /> Славянский бульвар через новый
            подземный переход.<br /><br />
            Также из обычного метро на МЦД-1 есть пересадки через:<br /><br />
          </p>

          <ul>
            <li>
              здание вокзала:
              <span> <img src="/m-d-g.png" alt="" /> Белорусская</span>,
              <span><img src="/m-g.png" alt="" /> Савёловская</span>;
            </li>
            <li>
              крытый переход:
              <span><img src="/m-p.png" alt="" /> Беговая</span>,
              <span><img src="/m-g.png" alt="" /> Тимирязевская</span>;
            </li>
            <li>
              уличный переход:
              <span><img src="/m-l-b.png" alt="" /> Фили</span>,
              <span><img src="/m-l-b.png" alt="" /> Выставочная</span>,
              <span><img src="/m-l-b.png" alt="" /> Международная</span>,
              <span><img src="/m-l-b.png" alt="" /> Кунцевская</span>,
              <span><img src="/m-d-b.png" alt="" /> Кунцевская</span>,<br />
              <span><img src="/m-l-g.png" alt="" /> Окружная</span>,
              <span><img src="/m-o.png" alt="" /> Окружная</span>,
              <span><img src="/m-o.png" alt="" /> Деловой центр</span>,
              <span><img src="/m-o.png" alt="" /> Шелепиха</span>,
              <span><img src="/m-ll.png" alt="" /> Шелепиха</span> и
              <span><img src="/m-ll.png" alt="" /> Савеловская</span>.
            </li>
          </ul>
        </div>
        <!--metro-->
        <div
          :class="{ tabContentActive: activeTab === 2 }"
          class="location-tabs__content"
        >
          <p>
            Вызывайте Яндекс.Такси или Uber — они могут проехать в Сколково без
            пропусков.<br /><br />

            <b>Адрес для такси:</b>
            <a href="" class="link">парковка Технопарк Сколково</a>.<br />
            Это ближайшая точка, куда подъезжает такси, — оттуда 3 минуты до
            входа на фестиваль.<br /><br />

            <b>НЕ вызывайте</b> такси в Инновационный центр, Технопарк Сколково,
            на Большой бульвар 42с1 и другие<br />
            адреса. В Сколково восемь въездов, и куда вас приведет навигатор —
            дело случая.<br /><br />

            Выходите из такси на парковке Технопарк Сколково и смотрите налево —
            там будет длинное здание<br />
            с буквами SK. Вам сюда!<br /><br />

            Если вы вызовете другое такси или ошибетесь с адресом, то вас
            остановят на КПП и попросят пропуск.<br />
            Его оформит волонтер у шлагбаума, но придется ждать.<br /><br />

            Лучше ехать на Яндекс.Такси или Uber и сразу вбивать адрес «парковка
            Технопарк Сколково»!
          </p>
        </div>
        <!--taxi-->
        <div
          :class="{ tabContentActive: activeTab === 3 }"
          class="location-tabs__content"
        >
          Поскольку в Сколково провели легкое метро МЦД-1, Стримфест больше не
          организует дополнительные автобусы до Сколково.<br /><br />

          Но на обычных городских автобусах до нас по-прежнему можно доехать:<br /><br />
          <ul>
            <li>
              <a href="" class="link">автобус 867</a>,
              <img src="/m-d-b.png" alt="" /> Молодёжная — Технопарк;
            </li>
            <li>
              <a href="" class="link">автобус 1147</a>,
              <img src="/m-r.png" alt="" /> Тропарево — Сколтех.
            </li>
          </ul>
          <br />
          Движение городских автобусов удобно отслеживать через приложение
          Яндекс.Карты (<a href="" class="link">Android</a>,
          <a href="" class="link">iOS</a>).<br /><br />

          Будьте внимательны: не все муниципальные маршруты до Сколково работают
          в выходные дни!
        </div>
        <!--bus-->
        <div
          :class="{ tabContentActive: activeTab === 4 }"
          class="location-tabs__content"
        >
          <p>
            До Сколково можно доехать по Минскому, Можайскому и Сколковскому
            шоссе и оставить машину на одной из двух парковок. Запарковать
            машину прямо перед зданием Технопарка нельзя: обычные машины не
            пускают на территорию.<br /><br />

            <b>Адрес для навигатора:</b>
            <a href="" class="link">парковка Технопарк Сколково</a>. Это
            ближайшая точка, куда можно приехать на машине, — оттуда 3 минуты до
            входа на фестиваль.<br /><br />

            <b>НЕ пишите</b> в навигаторе Инновационный центр, Технопарк
            Сколково, на Большой бульвар 42с1 и другие адреса. В Сколково восемь
            въездов, и куда вас приведет навигатор — дело случая.<br /><br />

            <a href="" class="link">Схема проезда и парковки</a>. Удобнее ехать
            по Минскому или Можайскому шоссе на парковку Технопарк.<br /><br />

            Если на шоссе пробка или парковка забита, вы можете проехать по
            Сколковскому шоссе и оставить машину на парковке Сколковская. Но она
            дальше — оттуда либо идти 20 минут, либо ехать на шаттле.<br /><br />

            Парковка Амальтея служебная, на ней парковаться нельзя.<br /><br />

            На всех парковках первые два часа бесплатно, а дальше — 50
            рублей/час.
          </p>
        </div>
        <!--car-->
        <div
          :class="{ tabContentActive: activeTab === 5 }"
          class="location-tabs__content"
        >
          <p>
            <b>Делимобиль</b>, <b>Belkacar</b> и <b>YouDrive Lab</b>: на
            парковках Технопарк и Сколковская можно завершить аренду или
            запарковать машину бесплатно.<br /><br />

            <b>Яндекс.Драйв, Anytime, МатрёшCar</b>: нельзя запарковать
            бесплатно или завершить аренду в Сколково — можно только поставить
            на ожидание.<br /><br />

            <b>Адрес для навигатора:</b>
            <a href="" class="link">парковка Технопарк Сколково</a>. Это
            ближайшая точка, куда можно приехать на машине, — оттуда 3 минуты до
            входа на фестиваль.<br /><br />

            <b>НЕ пишите</b> в навигаторе Инновационный центр, Технопарк
            Сколково, на Большой бульвар 42с1 и другие адреса. В Сколково восемь
            въездов, и куда вас приведет навигатор — дело случая.<br /><br />

            <a href="" class="link">Схема проезда и парковки.</a> Удобнее ехать
            по Минскому или Можайскому шоссе на парковку Технопарк.<br /><br />

            Если на шоссе пробка или парковка забита, вы можете проехать по
            Сколковскому шоссе и оставить машину на парковке Сколковская. Но она
            дальше — оттуда либо идти 20 минут, либо ехать на шаттле.<br /><br />

            Парковка Амальтея служебная, на ней парковаться нельзя.
          </p>
        </div>
        <!--carshare-->
      </div>
      <div class="location-bottom">
        <div class="location-bottom__left">
          <h3>Задай вопрос в ВК</h3>
          <div class="location-vk-btn">
            <svg width="14px" height="8px">
              <path
                fill-rule="evenodd"
                fill="rgb(255, 255, 255)"
                d="M6.852,7.889 L7.689,7.889 C7.689,7.889 7.942,7.862 8.071,7.724 C8.190,7.597 8.186,7.359 8.186,7.359 C8.186,7.359 8.170,6.244 8.691,6.080 C9.205,5.918 9.865,7.157 10.564,7.634 C11.093,7.994 11.495,7.915 11.495,7.915 L13.365,7.889 C13.365,7.889 14.344,7.829 13.880,7.066 C13.842,7.003 13.610,6.501 12.489,5.469 C11.316,4.389 11.474,4.564 12.886,2.695 C13.746,1.557 14.090,0.862 13.983,0.565 C13.881,0.281 13.248,0.356 13.248,0.356 L11.142,0.369 C11.142,0.369 10.986,0.348 10.870,0.417 C10.757,0.484 10.684,0.641 10.684,0.641 C10.684,0.641 10.351,1.522 9.907,2.271 C8.969,3.851 8.594,3.934 8.441,3.836 C8.084,3.607 8.173,2.918 8.173,2.427 C8.173,0.896 8.407,0.257 7.717,0.092 C7.488,0.037 7.320,0.001 6.734,-0.005 C5.983,-0.013 5.347,-0.003 4.987,0.173 C4.747,0.289 4.563,0.548 4.675,0.563 C4.814,0.581 5.130,0.648 5.297,0.873 C5.513,1.165 5.505,1.819 5.505,1.819 C5.505,1.819 5.629,3.622 5.215,3.846 C4.932,3.999 4.542,3.685 3.706,2.252 C3.278,1.518 2.954,0.706 2.954,0.706 C2.954,0.706 2.892,0.554 2.781,0.473 C2.646,0.375 2.457,0.343 2.457,0.343 L0.456,0.356 C0.456,0.356 0.156,0.364 0.046,0.494 C-0.053,0.610 0.038,0.848 0.038,0.848 C0.038,0.848 1.604,4.486 3.378,6.319 C5.005,8.000 6.852,7.889 6.852,7.889 L6.852,7.889 L6.852,7.889 Z"
              />
            </svg>
            <span>ПРЯМАЯ ЛИНИЯ: напиши Стримфесту в личку!</span>
          </div>
          <h4>Участники и программа</h4>
          <p>
            <a href="mailto:mike@streamfest.ru" class="link"
              >mike@streamfest.ru</a
            >
            — Михаил Лисецкий
          </p>
          <h4>Партнеры и интеграцииа</h4>

          <p>
            <a href="mailto:alyona@streamfest.ru" class="link"
              >alyona@streamfest.ru</a
            >
            — Алёна Лисецкая
          </p>

          <h4>Пресса, блогеры и паблики</h4>
          <p>
            <a href="mailto:pr@streamfest.ru" class="link">pr@streamfest.ru</a>
          </p>
          <h4>Любые вопросы по билетам</h4>
          <p style="margin-bottom: 32px">
            <a href="mailto:tickets@streamfest.ru" class="link"
              >tickets@streamfest.ru</a
            >
          </p>
          <div class="location-bottom__form">
            <textarea name="" placeholder="Ваше сообщение"></textarea>
            <input type="text" placeholder="Ваш email  — сюда отправим ответ" />
            <button class="blue-btn">отправить</button>
          </div>
        </div>
        <div class="location-bottom__right"></div>
      </div>
    </div>
    <Subscribe />
  </section>
</template>

<script>
import Subscribe from "@/components/Subscribe";

export default {
  scrollToTop: true,
  // auth: true,
  components: {
    Subscribe,
  },
  data() {
    return {
      activeTab: 1,
    };
  },
  watch: {},
  mounted() {},
  methods: {},
};
</script>
